Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
/******************************************************************************
* File Name:   main.c (CM4)
* Created on: 1 Jun 2024
* Author: r. santeler (based on MTB example)
*
* Description: This is the source code for the CM4 core in PSoC6_BatteryManagement.
*              Here all main features of the system are implemented. Code hosted
*              on this processor must never use blocking layouts during main loop,
*              due to safety critical functions. Code run once during initialization
*              can be blocking but must always be timeout terminated to make sure
*              the system enters main loop.
*
*              The main functions are described in this file. Diagnostic, CAN,
*              battery state management and safety switch functions are outsourced
*              to different files. Functions, definitions and objects that must be
*              accessed from all components are found in global_management.
*
*              All settings and parameters can be manipulated centrally in the
*              "SETTING DEFINITION" section of global_management.h
*
*              Note that commonly needed variables are grouped into statusBMS, setupBMS and batteryState.
*              Note that "ram_public.h" and "ipc_def.h" is used for communication between processors and the public RAM area.
*
*******************************************************************************
 * (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 * This software, including source code, documentation and related materials ("Software") is owned by Cypress Semiconductor Corporation or one of its affiliates ("Cypress") and is protected by and subject to worldwide patent protection (United States and foreign), United States copyright laws and international treaty provisions.  Therefore, you may use this Software only as provided in the license agreement accompanying the software package from which you obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive, non-transferable license to copy, modify, and compile the Software source code solely for use in connection with Cypress's integrated circuit products.  Any reproduction, modification, translation, compilation, or representation of this Software except as specified above is prohibited without the express written permission of Cypress.
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress reserves the right to make changes to the Software without notice. Cypress does not assume any liability arising out of the application or use of the Software or any product or circuit described in the Software. Cypress does not authorize its products for use in any products where a malfunction or failure of the Cypress product may reasonably be expected to result in significant property damage, injury or death ("High Risk Product"). By including Cypress's product in a High Risk Product, the manufacturer of such system or application assumes all risk of such use and in doing so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#include <stdint.h>
#include <math.h>
#include <time.h>
#include <stdlib.h>

#include "cycfg.h"
#include "cy_pdl.h"
#include "cyhal.h"
#include "cybsp.h"
#include "cy_retarget_io.h"
// Cross processor communication and common elements
#include "ipc_def.h"
#include "ram_public.h"
// BMS functionality abstraction
#include "global_management.h"	// Common elements between all components on CM4 core
#include "safety_switch.h"		// Safety switch related functions (init, get/set switch state, etc)
#include "memory.h"				// Memory related functions
#include "balancing.h"			// Battery balancing related functions
#include "diagnostic.h"			// Diagnostic subsystem
#include "IMR2_CAN_GLOBAL.h"	// External CAN communication abstraction
// Peripheral component library's - The analog frontend tle9012, the external ADC and the memory
#include "BMS_TLE9012/BMS_TLE9012.h"
#include "MCP3x6x/MCP3x6x_ADC.h"
#include "MCP3x6x/MCP3x6x_SPI.h"
#include "MCP3x6x/MCP3x6x_Type.h"
#include "FRAM_DIRECT_SPI/FRAM_DIRECT_SPI.h"

/*******************************************************************************
* Debug message definitions - Un/comment the printf commands to show or hide certain messages
*******************************************************************************/
#define PRINTF_MAIN_DEBUG(p_frm, ...)				printf(p_frm, ##__VA_ARGS__)
#define PRINTF_HOT_SWAP(p_frm, ...)					printf(p_frm, ##__VA_ARGS__)
#define PRINTF_MEASUREMENT(p_frm, ...)				//printf(p_frm, ##__VA_ARGS__)
#define PRINTF_MAIN_RT_GETLINE_DEBUG(p_frm, ...)	//printf(p_frm, ##__VA_ARGS__)
#define PRINTF_MAIN_RT_CAN_REQUEST(p_frm, ...)		printf(p_frm, ##__VA_ARGS__)
#define TIMER_COUNTER_1MS 							Cy_TCPWM_Counter_GetCounter(TIMER_1MS_HW, TIMER_1MS_NUM)

/*******************************************************************************
* Common variables
*******************************************************************************/
// SPI object and mode indicator
cyhal_spi_t mSPI;				// SPI used for safety switch 2ED4820, ADC MCP3465 and Memory CY15B256Q-SXA. Use "extern" if needed in other files
cyhal_spi_mode_t mSPI_curMode;	// Marks currently set SPI mode. Needed because SPI devices require different SPI modes and must reinitialize SPI if mode is not correct for them. Use "extern" if needed in other files

/* Shadow buffer for public variables*/
uint32_t  	 sh_pub_error_map = 0;
uint16_t 	 sh_pub_soc = 0;
uint16_t 	 sh_pub_soh = 0;
uint16_t 	 sh_pub_volt = 0;
int16_t 	 sh_pub_current = 0;
outputStates sh_pub_outputState = OUTPUT_OFF;
slotStates	 sh_pub_slotState = SLOT_NONE;
uint16_t 	 sh_pub_cells[NUM_CELLS];
public_core_commands 	 sh_pub_command = PUBLIC_COMMAND_IGNORE;

// Timer
cy_stc_rtc_config_t dateTime;
cyhal_wdt_t wdt_obj; // Watchdog object

// Init
uint8_t initTLE9012Error = 0;
uint8_t initExtADCError = 0;

// Marker for direct save state set on error interrupt. If this is 0 any error interrupt will activate the save state for a short time to switch system off without main loop.
uint8_t SafetySwitchInterrupt_SaveStateSet = DIRECT_SAVESTATE_ON_INTERRUPT;
uint8_t AnalogFrontendInterrupt_SaveStateSet = DIRECT_SAVESTATE_ON_INTERRUPT;


