Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
/*******************************************************************************
* Function Prototypes
*******************************************************************************/
// Initialization functions (run once at start) - blocking code allowed
void init_UART_debug();
void init_UART_tle9012();
void init_CAN();
void init_Timer_RTC();
void init_SPI_peripheral();
void init_interrupt_2ED4820();
void init_interrupt_TLE9012();
void init_internal_ADC();
void init_external_ADC_MCP3465();
void init_hotSwap();
requestResult init_analogFrontendTLE9012();
void init_batteryState();

// Loop function (run every cycle) - no blocking code allowed
void processMeasurements();
void manage_SystemAndSwitchState();
void manage_externalCommunicationBMS();
void manage_analogFrontendTLE9012();
uint8_t manage_external_ADC_MCP3465(uint8_t waitForCurrentMeasTrigger);
void manage_internal_ADC();
void manage_timer();
void manage_slotState(uint8_t ignoreDebounce);
void manage_shutdown();

// Special functions
void keepHardwareWatchdogAlive();
void shutdownSystem();
void reset_safetySwitchTurnOn();
void reset_latchedBitmaps(uint8_t reset_error_map_switch_on, uint8_t reset_error_map_ext_com);
void calc_voltageChangeRate(float loadVoltage, float minLoadVoltage);
uint8_t updatePublicDisplayData(public_core_commands command); // Update public variables from shadow buffer if resource is not used at the moment (non blocking)

// Interrupt routines
void timer_watchdog_interrupt_handler();
static void IRQ_ERR_2ED4820(void* handler_arg, cyhal_gpio_event_t event); // Error pin interrupt from safety switch
static void IRQ_ERR_TLE9012(void* handler_arg, cyhal_gpio_event_t event); // Error pin interrupt from analog frontend


// Test functions
void debugButtonCheck(); // Function extraction of debug code executed when debug button is pressed
void debugRecordCycleTime();





int main(void)
{
    cy_rslt_t result;

    // ---- INIT CM4 ---- blocking code allowed (but must finished in reasonable time)
    /* Initialize the device and board peripherals */
    result = cybsp_init() ;
    if (result != CY_RSLT_SUCCESS){ cyhal_gpio_write(BMS_LED3_RD, 1); cyhal_system_delay_ms(500); cyhal_gpio_write(VCC_HOLD, 0); CY_ASSERT(0); }

	// Init millisecond counter timer and Real Time Clock
	init_Timer_RTC();

    // Initialize Hardware Watchdog
	#if ENABLE_HARDWARE_WATCHDOG == 1
		result = cyhal_wdt_init(&wdt_obj, HARDWARE_WATCHDOG_TIMEOUT);
		if (result != CY_RSLT_SUCCESS){
			cyhal_gpio_write(BMS_LED4_BL, 1); cyhal_gpio_write(BMS_LED3_RD, 1);
			cyhal_system_delay_ms(1000);
			cyhal_gpio_write(VCC_HOLD, 0);
			CY_ASSERT(0);
		}
		keepHardwareWatchdogAlive();
	#endif /* #if defined (ENABLE_HARDWARE_WATCHDOG) */

    // Init debug message sending via printf
	init_UART_debug();

	#if (ACTIVATE_CELL_ERROR_IGNORE == 1 || ENABLE_HARDWARE_WATCHDOG == 0 || ENABLE_SOFTWARE_WATCHDOG == 0)
		PRINTF_MAIN_DEBUG("\r\n\r\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!   WATCHDOGS OR CELL ERRORS ARE BYPASSED FOR DEBUGGING, SAFETY FEATURES ARE COMPROMISED IN THIS SYSTEM. DO NOT DISTRIBUTE, DO NOT USE OUTSIDE OF LAB   !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n");
		cyhal_gpio_write(LED_Red, 0);
	#endif
	PRINTF_MAIN_DEBUG("\r\n\r\n--------------------------------------------------------------------\r\n");
	PRINTF_MAIN_DEBUG("START CM4 - Version 22.11.2024 Release 1.3\r\n");
	PRINTF_MAIN_DEBUG("\t Last shutdown reason %u (on hard resets, system might restart multiple times!)\r\n", (uint16_t)cyhal_system_get_reset_reason());
	//CYHAL_SYSTEM_RESET_NONE            = 0,   /**< No cause */
	//CYHAL_SYSTEM_RESET_WDT             = 1,   /**< A watchdog timer (WDT) reset has occurred */
	//CYHAL_SYSTEM_RESET_ACTIVE_FAULT    = 2,   /**< The fault logging system requested a reset from its Active logic. */
	//CYHAL_SYSTEM_RESET_DEEPSLEEP_FAULT = 4,   /**< The fault logging system requested a reset from its Deep-Sleep logic. */
	//CYHAL_SYSTEM_RESET_SOFT            = 8,   /**< The CPU requested a system reset through it's SYSRESETREQ. */
	//CYHAL_SYSTEM_RESET_HIB_WAKEUP      = 16,  /**< A reset has occurred due to a a wakeup from hibernate power mode. */
	//CYHAL_SYSTEM_RESET_WCO_ERR         = 32,  /**< A reset has occurred due to a watch-crystal clock error */
	//CYHAL_SYSTEM_RESET_SYS_CLK_ERR     = 64,  /**< A reset has occurred due to a system clock error */
	//CYHAL_SYSTEM_RESET_PROTECTION      = 128, /**< A reset has occurred due to a protection violation */
	//CYHAL_SYSTEM_RESET_WARMBOOT        = 256, /**< A reset has occurred due wake up from DSRAM, which is a Warm Boot */

	// Keep hardware watchdog alive
	keepHardwareWatchdogAlive();

	// Init communication interface with tle9012 analog frontend
	init_UART_tle9012();

	// Init SPI for 2ED4820, Memory and external ADC
	init_SPI_peripheral();

	// Init interrupts
	init_interrupt_2ED4820();
	init_interrupt_TLE9012();

	// Initialize analog resources
	init_internal_ADC();

	// Keep hardware watchdog alive
	keepHardwareWatchdogAlive();

	// Read slot state for the first time
	manage_slotState(1);

	// From this point keep the power alive. The green MCU ready LED is turned on later when pin is full on o that system does not shut down after it is released.
	// Doing it here prevents the system from starting up after reset/shutdown etc
	cyhal_gpio_write(VCC_HOLD, 1);
	cyhal_system_delay_ms(10);

	/* Enable global interrupts */
	__enable_irq();

	// Init and setup MOSFET driver (and write Setup to debug)
	initSwitchDriver();
	setSwitchIsolating();
	cyhal_system_delay_ms(50);

	// Keep hardware watchdog alive
	keepHardwareWatchdogAlive();

	// Turn on green LED
	cyhal_gpio_write(BMS_LED1_GR, 1);

	// Init Memory
	//FRAM_testTerminal(); // Enter a testing terminal for the memory. Need to be activated in FRAM_DIRECT_SPI.h
	init_memory();

	// Initialize MCP3465 external ADC and wait till enough measurements are done to ensure correct filtering
	isCurrentOffsetCalibrating = 1;
	init_external_ADC_MCP3465();

	// Initialize TLE9012 analog frontend
	if(init_analogFrontendTLE9012() != REQUEST_OK){
		PRINTF_MAIN_DEBUG("TLE9012 init not successful! -------------------- \r\n");
		// If the init fails show both TLE9012 errors
		initTLE9012Error = 1;
		numComErrors_TLE9012 = 99;
	}

	// Keep hardware watchdog alive
	keepHardwareWatchdogAlive();

    // Initialize SoC and SoH of the system
    init_batteryState();

    // Initialize CAN communication
	init_CAN();
	// Determine initial role of BMS
	init_hotSwap();

    /* Unlock all semaphores and wake-up the CM0+ */
    Cy_IPC_Sema_Clear(SEMA_BTN,         false);
	Cy_IPC_Sema_Clear(SEMA_DISPLAY_VAR, false);
	Cy_IPC_Sema_Clear(SEMA_DEBUG_MSG, 	false);
	Cy_IPC_Sema_Clear(SEMA_START, 		false);
	__SEV();

	// Deactivate offset calibration
	isCurrentOffsetCalibrating = 0;

	// First batteryState estimation
	manage_battery_state();

	// Enable software watchdog
	mainLoopCounter_lastWatchdog = UINT32_MAX;
	isWatchdogActive = ENABLE_SOFTWARE_WATCHDOG;
	// Keep hardware watchdog alive
	keepHardwareWatchdogAlive();

