Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
	// Reset all control CAN message counter
	resetCanMessageCounters();

	PRINTF_MAIN_DEBUG("\r\n\r\n---------------------------------------\r\n");
	PRINTF_MAIN_DEBUG("MAIN LOOP\r\n");

	// ---- MAIN LOOP CM4 ---- No blocking code below this line
    for (;;)
    {
	    // Read voltages, currents, temperatures etc
	    processMeasurements();

	    // Check if system is in slot
	    manage_slotState(0);

		// Check if balancing conditions are met, execute balancing algorithm and determine the mapping of which cell needs balancing (actual write performed in processMeasurements())
		manage_balancing();

	    // Receive (when possible) errors and warnings from safety switch, analog frontend TLE9012 and rest of system.
	    // Set bms_state to BMS_ERROR if needed or to BMS_IDLE if error cleared. Controls red LED.
	    doSystemDiagnostic();

		// Control switch state based on bms_state. When no error present determine bms_state charge direction, precharge and minimum restart timer.
		manage_SystemAndSwitchState();

		// Manage data from and to the BMS (CAN, UART debug, etc). Resets latched bitmaps
		manage_externalCommunicationBMS();

    	// Processing of TLE9012 queue, interpreter and data
    	manage_analogFrontendTLE9012();

    	// Estimate SoC and SoH
    	manage_battery_state();

    	// Manage Timer overflow
    	manage_timer();

    	// If shutdown button is pressed kill system by disabling shutdown pin
		manage_shutdown();

    	// Update public variables from shadow buffer if resource is not used at the moment (non blocking)
    	updatePublicDisplayData(PUBLIC_COMMAND_IGNORE);

    	// Update memory if needed
    	manage_memory();

		// Debug functions if button was pressed
		debugButtonCheck();

    	// Debug: Record cycle time for some time and print it
    	//debugRecordCycleTime();

    	// Keep software watchdog alive - Increment main loop counter to keep watchdog handler inactive
    	mainLoopCounter++;

    	// Keep hardware watchdog alive
    	keepHardwareWatchdogAlive();
    }
}

//****************************************************************************
// timer_watchdog_interrupt_handler - Handler function for the watchdog timer (check if main loop died)
//****************************************************************************
void timer_watchdog_interrupt_handler(){
    // If main loop counter did non change since last time shut down system
    if(isWatchdogActive == 1 && mainLoopCounter == mainLoopCounter_lastWatchdog){
    	PRINTF_MAIN_DEBUG("System watchdog detected no activity for %d ms and will deactivate system (%ld == %ld)\r\n", SOFTWARE_WATCHDOG_TIMEOUT, mainLoopCounter, mainLoopCounter_lastWatchdog);

    	// Disable MOSFETs/current flow by activating save state
    	setSafestate(SET_SAFE_STATE_ON);

		// Disable shutdown pin and wait till voltage source breaks down
		cyhal_gpio_write(BMS_LED1_GR, 0);
		cyhal_gpio_write(BMS_LED2_OR, 1);
		cyhal_gpio_write(BMS_LED3_RD, 1);
		cyhal_gpio_write(BMS_LED4_BL, 1);
		for(int i = 0; i < 12; i++){
			cyhal_system_delay_ms(50);
			cyhal_gpio_toggle(BMS_LED1_GR);
			cyhal_gpio_toggle(BMS_LED2_OR);
			cyhal_gpio_toggle(BMS_LED3_RD);
			cyhal_gpio_toggle(BMS_LED4_BL);
			cyhal_gpio_write(VCC_HOLD, 0);
		}
    }

    // Store last state of main loop counter
    mainLoopCounter_lastWatchdog = mainLoopCounter;

    // Kill system if shutdown button is continuously pressed for multiple seconds (this code also runs on CM0 to make sure a shutdown is possible even if one core stops working)
	static uint32_t shutdownButtonNotPressedTimestamp;
	if(cyhal_gpio_read(BUTTON_SHUTDOWN) == 0)
		shutdownButtonNotPressedTimestamp = TIMER_COUNTER_1MS;
	if(TIMER_COUNTER_1MS > (shutdownButtonNotPressedTimestamp + MAXIMUM_SHUTDOWN_TIME)){
		PRINTF_MAIN_DEBUG("HARD SHUTDOWN TRIGGERED - BUTTON PRESSED FOR LONGER THAN MAXIMUM_SHUTDOWN_TIME\r\n");
		cyhal_gpio_write(VCC_HOLD, 0);
		shutdownSystem();
	}

    // Kill system if refresh of display with resulting shutdown took to long
	if((isShutdownTriggered == 1) && (TIMER_COUNTER_1MS > (shutdownTriggeredTimestamp + MAXIMUM_SHUTDOWN_TIME))){
		PRINTF_MAIN_DEBUG("HARD SHUTDOWN TRIGGERED - SHUTDOWN TOOK LONGER THAN MAXIMUM_SHUTDOWN_TIME\r\n");
		shutdownSystem();
	}

    // Clear the terminal count interrupt
    Cy_TCPWM_ClearInterrupt(TIMER_WATCHDOG_HW, TIMER_WATCHDOG_NUM, CY_TCPWM_INT_ON_TC );
}

//****************************************************************************
// init_UART_debug - Initialize debug message sending via printf
//****************************************************************************
void init_UART_debug(){
	cy_rslt_t result;
	/* Free the hardware instance object if initialized by other core
	 * before initializing the same hardware instance object in this core. */
	cyhal_hwmgr_free(&CYBSP_UART_obj);
	cyhal_hwmgr_free(&CYBSP_DEBUG_UART_RX_obj);
	cyhal_hwmgr_free(&CYBSP_DEBUG_UART_TX_obj);

	/* Initialize retarget-io to use the debug UART port. */
	result = cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX, CY_RETARGET_IO_BAUDRATE);
	if (result != CY_RSLT_SUCCESS){ CY_ASSERT(0); }
}

//****************************************************************************
// init_UART_tle9012 - Initialize communication with TLE9012
//****************************************************************************
void init_UART_tle9012(){
	// Initialize analog frontend TLE9012 UART
	cy_rslt_t result_uart_tle = tle9012_initUART();
	if (result_uart_tle == CY_RSLT_SUCCESS){ PRINTF_MAIN_DEBUG("Init UART TLE9012: %d\r\n", (int)result_uart_tle); }
	else{ PRINTF_MAIN_DEBUG("Init UART TLE9012 failed: %d\r\n", (int)result_uart_tle); }
}

// Initialize the interrupt vector table with the timer interrupt handler address and assign priority.
cy_stc_sysint_t timer_watchdog_interrupt_config =
{
    /* Interrupt source is Timer interrupt */
    .intrSrc = TIMER_WATCHDOG_IRQ,

    /* Interrupt priority is 1 */
    .intrPriority = 1UL
};

//****************************************************************************
// init_CAN - Initialize CAN communication
//****************************************************************************
void init_CAN(){
	/* Init CANFD */
	cy_en_canfd_status_t status_can = init_canfd();
	if (status_can != CY_CANFD_SUCCESS){ CY_ASSERT(0); }
}

//****************************************************************************
// init_Timer_RTC - Init millisecond counter timer and Real Time Clock
//****************************************************************************
void init_Timer_RTC(){
	// Init RTC
	Cy_RTC_Init(&srss_0_rtc_0_config);

	// Enable millisecond timer
	cy_en_tcpwm_status_t result_timer = Cy_TCPWM_Counter_Init(TIMER_1MS_HW, TIMER_1MS_NUM, &TIMER_1MS_config);
	if (CY_TCPWM_SUCCESS != result_timer) {PRINTF_MAIN_DEBUG("Init TIMER_1MS failed: %d\r\n", (int)result_timer);}
	// Enable the initialized counter
	Cy_TCPWM_Counter_Enable(TIMER_1MS_HW, TIMER_1MS_NUM);
	// Then start the counter
	Cy_TCPWM_TriggerStart_Single(TIMER_1MS_HW, TIMER_1MS_NUM);


	// Init watchdog interrupt
	cy_rslt_t result = Cy_SysInt_Init(&timer_watchdog_interrupt_config, timer_watchdog_interrupt_handler);
	if(result != CY_SYSINT_SUCCESS){ PRINTF_MAIN_DEBUG("Interrupt init TIMER_WATCHDOG failed: %d\r\n", (int)result); }
	/* Enable Interrupt */
	NVIC_EnableIRQ(timer_watchdog_interrupt_config.intrSrc);

