Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
	// Enable watchdog timer
	cy_en_tcpwm_status_t result_timer_wd = Cy_TCPWM_Counter_Init(TIMER_WATCHDOG_HW, TIMER_WATCHDOG_NUM, &TIMER_WATCHDOG_config);
	if (CY_TCPWM_SUCCESS != result_timer_wd) {PRINTF_MAIN_DEBUG("Init TIMER_WATCHDOG failed: %d\r\n", (int)result_timer_wd);}
	// Enable the initialized counter
	Cy_TCPWM_Counter_Enable(TIMER_WATCHDOG_HW, TIMER_WATCHDOG_NUM);

	// Check if the desired interrupt is enabled prior to triggering
	if (0UL != (CY_TCPWM_INT_ON_TC & Cy_TCPWM_GetInterruptMask(TIMER_WATCHDOG_HW, TIMER_WATCHDOG_NUM))) {
		Cy_TCPWM_SetInterrupt(TIMER_WATCHDOG_HW, TIMER_WATCHDOG_NUM, CY_TCPWM_INT_ON_TC);
	}

    // Set the timer period in milliseconds. To count N cycles, period should be set to N-1.
    Cy_TCPWM_Counter_SetPeriod(TIMER_WATCHDOG_HW, TIMER_WATCHDOG_NUM, SOFTWARE_WATCHDOG_TIMEOUT-1 );

	// Then start the counter
	Cy_TCPWM_TriggerStart_Single(TIMER_WATCHDOG_HW, TIMER_WATCHDOG_NUM);
}

//****************************************************************************
// init_SPI_peripheral - Startup and setup SPI used for all peripherals except display
//****************************************************************************
void init_SPI_peripheral() {
	cy_rslt_t result;
	// Init hal SPI for 2ED4820 (does not matter for which device it is configured, will reinitialized when needed for each device)
	result = cyhal_spi_init(&mSPI,PERI_SPI_MOSI,
							PERI_SPI_MISO,
							PERI_SPI_CLK,
							NC,NULL,8,CYHAL_SPI_MODE_01_MSB,false);

	// Set the SPI baud rate
	if (CY_RSLT_SUCCESS == result) {
		PRINTF_MAIN_DEBUG("Init SPI first %d\r\n", (int)(uint8_t)result);
		result = cyhal_spi_set_frequency(&mSPI, 5000000);
		if (CY_RSLT_SUCCESS != result) {
			PRINTF_MAIN_DEBUG("Failed to set SPI Frequency first %d\r\n", (int)(uint8_t)result);
		}
	}
	else{
		PRINTF_MAIN_DEBUG("Failed to init SPI first %d\r\n", (int)(uint8_t)result);
	}
	mSPI_curMode = CYHAL_SPI_MODE_01_MSB;

	// Init SPI CS 2ED4820
    result = cyhal_gpio_init(PERI_SPI_CS_2ED4820, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, 1);
	if (CY_RSLT_SUCCESS == result) {
		PRINTF_MAIN_DEBUG("\tInit CS pin 2ED4820: %d\r\n", (int)(uint8_t)result);
	}
	else{
		PRINTF_MAIN_DEBUG("\tFailed to init CS pin 2ED4820: %d\r\n", (int)(uint8_t)result);
	}

	// Init SPI CS MCP3465R
    result = cyhal_gpio_init(PERI_SPI_CS_MCP3465, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, 1);
	if (CY_RSLT_SUCCESS == result) {
		PRINTF_MAIN_DEBUG("\tInit CS pin ADC MCP3465: %d\r\n", (int)(uint8_t)result);
	}
	else{
		PRINTF_MAIN_DEBUG("\tFailed to init CS pin ADC MCP3465: %d\r\n", (int)(uint8_t)result);
	}

	// Init SPI CS CY15B256
    result = cyhal_gpio_init(PERI_SPI_CS_CY15B, CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, 1);
	if (CY_RSLT_SUCCESS == result) {
		PRINTF_MAIN_DEBUG("\tInit CS pin MEM CY15B256: %d\r\n", (int)(uint8_t)result);
	}
	else{
		PRINTF_MAIN_DEBUG("\tFailed to init CS pin MEM CY15B256: %d\r\n", (int)(uint8_t)result);
	}

	// Init enable pin
    result = cyhal_gpio_init(D_2ED4820_ENABLE, CYHAL_GPIO_DIR_BIDIRECTIONAL, CYHAL_GPIO_DRIVE_STRONG, 0);
	if (CY_RSLT_SUCCESS == result) {
		PRINTF_MAIN_DEBUG("\tInit Enable pin 2ED4820: %d\r\n", (int)(uint8_t)result);
	}
	else{
		PRINTF_MAIN_DEBUG("\tFailed to init Enable pin 2ED4820: %d\r\n", (int)(uint8_t)result);
	}

	// Init safestate pin
	result = cyhal_gpio_init(D_2ED4820_SAVE_STATE_EN, CYHAL_GPIO_DIR_BIDIRECTIONAL, CYHAL_GPIO_DRIVE_PULLDOWN, 0);
	if (CY_RSLT_SUCCESS == result) {
		PRINTF_MAIN_DEBUG("\tInit SaveState pin 2ED4820: %d\r\n", (int)(uint8_t)result);
	}
	else{
		PRINTF_MAIN_DEBUG("\tFailed to init SaveState pin 2ED4820: %d\r\n", (int)(uint8_t)result);
	}
}

//****************************************************************************
// 2ED4820 Interrupt function, object and init
//****************************************************************************
// Interrupt handler callback function
static void IRQ_ERR_2ED4820(void *handler_arg, cyhal_gpio_event_t event)
{
	CY_UNUSED_PARAMETER(handler_arg);
	CY_UNUSED_PARAMETER(event);

	// Directly set the safe state (no main loop interaction required)
	if(SafetySwitchInterrupt_SaveStateSet == 0){
		setSafestate(SET_SAFE_STATE_ON);
		cyhal_system_delay_us(100);
		setSafestate(SET_SAFE_STATE_OFF);
		SafetySwitchInterrupt_SaveStateSet = 1;
	}

	// Mark error
	errorInterruptDetected_2ED4820 = 1;
}
// Interrupt object
cyhal_gpio_callback_data_t gpio_2ED4820_callback_data = {
	.callback     = IRQ_ERR_2ED4820
};
// Interrupt initialization function
void init_interrupt_2ED4820(){
	cy_rslt_t rslt;
	rslt = cyhal_gpio_init(D_2ED4820_INT, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLDOWN, 0);
	if(CY_RSLT_SUCCESS != rslt){
		PRINTF_MAIN_DEBUG("[ERROR]: init_interrupt_2ED4820 error %ld\r\n", rslt);
	}
	else{
		PRINTF_MAIN_DEBUG("init_interrupt_2ED4820 done\r\n");
	}
	cyhal_gpio_register_callback(D_2ED4820_INT, &gpio_2ED4820_callback_data);		    			// Register callback function - gpio_interrupt_handler and pass the value global_count
    cyhal_gpio_enable_event(D_2ED4820_INT, CYHAL_GPIO_IRQ_RISE, CYHAL_ISR_PRIORITY_DEFAULT, 1);	// Enable rising edge interrupt event with interrupt priority set to 3
}

//****************************************************************************
// TLE9012 Interrupt function, object and init
//****************************************************************************
// Interrupt handler callback function
static void IRQ_ERR_TLE9012(void *handler_arg, cyhal_gpio_event_t event)
{
	CY_UNUSED_PARAMETER(handler_arg);
	CY_UNUSED_PARAMETER(event);

	// Directly set the safe state (no main loop interaction required)
	if(AnalogFrontendInterrupt_SaveStateSet == 0){
		setSafestate(SET_SAFE_STATE_ON);
		cyhal_system_delay_us(100);
		setSafestate(SET_SAFE_STATE_OFF);
		AnalogFrontendInterrupt_SaveStateSet = 1;
	}

	// Mark error
	errorInterruptDetected_TLE9012 = 1;
}
// Interrupt object
cyhal_gpio_callback_data_t gpio_TLE9012_callback_data = {
	.callback     = IRQ_ERR_TLE9012
};
// Interrupt initialization function
void init_interrupt_TLE9012(){
	cy_rslt_t rslt;
	rslt = cyhal_gpio_init(TLE9012_ERR, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLDOWN, 0);
	if(CY_RSLT_SUCCESS != rslt){
		PRINTF_MAIN_DEBUG("[ERROR]: init_interrupt_TLE9012 error %ld\r\n", rslt);
	}
	else{
		PRINTF_MAIN_DEBUG("init_interrupt_TLE9012 done\r\n");
	}
	cyhal_gpio_register_callback(TLE9012_ERR, &gpio_TLE9012_callback_data);		    				// Register callback function - gpio_interrupt_handler and pass the value global_count
    cyhal_gpio_enable_event(TLE9012_ERR, CYHAL_GPIO_IRQ_RISE, CYHAL_ISR_PRIORITY_DEFAULT, true);	// Enable falling edge interrupt event with interrupt priority set to 3
}

//****************************************************************************
// init_internal_ADC - This function initializes analog components - SAR ADC
//****************************************************************************
void init_internal_ADC()
{
    /* Variable to capture return value of functions */
    cy_rslt_t result;

    /* Initialize AREF */
    result = Cy_SysAnalog_Init(&pass_0_aref_0_config);
    if (CY_SYSANALOG_SUCCESS != result)
    {
        CY_ASSERT(0);
    }

    /* Enable AREF */
    Cy_SysAnalog_Enable();

    /* Initialize common resources for SAR ADCs. */
    /* Common resources include simultaneous trigger parameters, scan count
       and power up delay. This is configured in the device configurator. */
	//    result = Cy_SAR_CommonInit(PASS, &pass_0_saradc_0_config);
	//    if (CY_SAR_SUCCESS != result)
	//    {
	//        CY_ASSERT(0);
	//    }

