Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
    /* Initialize SAR_HW and SAR1 */
    result = Cy_SAR_Init(SAR_HW, &SAR_config );
    if (CY_SAR_SUCCESS != result)
    {
        CY_ASSERT(0);
    }

    /* Enable SAR block */
    Cy_SAR_Enable(SAR_HW);

    //Cy_SAR_SetInterruptMask(SAR_HW, CY_SAR_INTR);

    //(void)Cy_SysInt_Init(&SAR_HW_IRQ_cfg, SAR_HW_interrupt);

    /* Enable the SAR interrupts */
    //NVIC_EnableIRQ(SAR_HW_IRQ_cfg.intrSrc);

    //Cy_SAR_StartConvert(SAR_HW, CY_SAR_START_CONVERT_CONTINUOUS);


	// Read slot state for the first time
    Cy_SAR_StartConvert(SAR_HW, CY_SAR_START_CONVERT_SINGLE_SHOT);
    cyhal_system_delay_ms(50);
    manage_internal_ADC();
	Cy_SAR_StartConvert(SAR_HW, CY_SAR_START_CONVERT_SINGLE_SHOT);
	cyhal_system_delay_ms(10);
}

//****************************************************************************
// init_external_ADC_MCP3465 - Initialize external ADC chip
//****************************************************************************
void init_external_ADC_MCP3465() {
	// Write all configuration registers
    PRINTF_MAIN_DEBUG("Init SPI ADC MCP3465:\r\n");
    PRINTF_MAIN_DEBUG("\tADC Write  _CONFIG0_: %X\r\n", CONFIG0_CFG);
    SPI_WRT(_CONFIG0_, CONFIG0_CFG);
    cyhal_system_delay_ms(10);
    PRINTF_MAIN_DEBUG("\tADC Write  _CONFIG1_: %X\r\n", CONFIG1_CFG);
    SPI_WRT(_CONFIG1_, CONFIG1_CFG);
    cyhal_system_delay_ms(10);
    PRINTF_MAIN_DEBUG("\tADC Write  _CONFIG2_: %X\r\n", CONFIG2_CFG);
    SPI_WRT(_CONFIG2_, CONFIG2_CFG);
    cyhal_system_delay_ms(10);
    PRINTF_MAIN_DEBUG("\tADC Write  _CONFIG3_: %X\r\n", CONFIG3_CFG);
    SPI_WRT(_CONFIG3_, CONFIG3_CFG);
    cyhal_system_delay_ms(10);

    // Initialize first measurement on channel 1
    activeChannelExternalADC = ACTIVE_EXT_ADC_CH1_LOAD_VOLTAGE;
    CONV_START(MUX_CFG_CH1_SINGLE_END);

	// Initialize MCP3465 external ADC and wait till enough measurements are done to ensure correct filtering
	isCurrentOffsetCalibrating = 1;
	uint16_t readSuccessfulCount = 0;
	adcZeroingTimestamp = TIMER_COUNTER_1MS; // Store timestamp for timeout
	// Try to read results until wanted number of reads are read, timeout occurred (used for loop to avoid while(true))
	for(uint16_t i = 0; i < UINT16_MAX; i++){
		// Trigger potential read
		uint8_t readChannelresult = manage_external_ADC_MCP3465(0);

		// Log how often a valid result was received
		if(readChannelresult != 0){
			readSuccessfulCount++;
		}

		// If amount of needed results is reached stop load
		if(readSuccessfulCount >= ADC_EXT_ZEROING_NUM){
			PRINTF_MAIN_DEBUG("\t\tExternal ADC read %d times for zeroing. Read successful after %ld ms\r\n", readSuccessfulCount, TIMER_COUNTER_1MS-adcZeroingTimestamp);
			return;
		}

		// Stop loop if takes to long
		if(TIMER_COUNTER_1MS > (adcZeroingTimestamp + ADC_EXT_ZEROING_TIMEOUT_TIME)){
			PRINTF_MAIN_DEBUG("[ERROR]: External ADC read %d times for zeroing. Read took too long (Timeout)\r\n", readSuccessfulCount);
			// Mark permanent error (if this flag is set manage_external_ADC_MCP3465 will keep the timeout and therefore the error triggered even if it disappears)
			initExtADCError = 1;
			return;
		}

		// Limit speed of result request
		cyhal_system_delay_ms(ADC_EXT_ZEROING_DELAY);
	}

	// Mark permanent error
	initExtADCError = 1;
}

//****************************************************************************
// init_hotSwap - Determine if the BMS shall start normally (alone in system, in charger or not in slot) in HotSwap MAIN mode or in HotSwap TAKER role
//****************************************************************************
void init_hotSwap(){
	// Print debug messages
	PRINTF_MAIN_DEBUG("HotSwap Role: \r\n");

	// Init hot swap state check variables
	uint8_t  wasSlotStateConstantOnASystem = 1;
	uint8_t  wasExternalVoltageAboveThreshold = 0;
	uint8_t  wasSwitchOnVetoReceived = 0;
	uint16_t switchOnVetoReceivedSocOtherBMS = 0;
	uint8_t  switchOnVetoReceivedActiveStateOtherBMS = 0;
	uint16_t switchOnVetoSendSuccessCounter = 0;

	cy_en_canfd_status_t can_status;

	// Get initial slot state
	manage_slotState(1);
	slotStates hotSwap_initialSlotState = statusBMS.slotState;

	// Store SoC in CAN data, to be send with switchOnVeto
	uint8_t targetData[6];
	targetData[0] = (uint8_t)statusBMS.SoC;
	targetData[1] = 0; // Set active state off

	// Hotswap state acquisition
	uint32_t hotSwapInitStartTimestamp = TIMER_COUNTER_1MS;
	while(TIMER_COUNTER_1MS < (hotSwapInitStartTimestamp + HOTSWAP_INIT_SWITCHON_VETO_TIME)){
		// Check if slot state stays the same
		manage_slotState(1);
		if(statusBMS.slotState != hotSwap_initialSlotState){
			wasSlotStateConstantOnASystem = 0;
		}
		// Check if a switch on veto was received
		if(receivedCanSwitchOnVetoCount != 0){
			wasSwitchOnVetoReceived = 1;
			switchOnVetoReceivedSocOtherBMS = receivedCanSwitchOnVetoSoC;
			switchOnVetoReceivedActiveStateOtherBMS |= receivedCanSwitchOnVetoActiveState; // Used or operator to make variable true even if it was 1 only once
		}
		// Check if a external load voltage was detected (other BMS is supplying)
		if(statusBMS.extLoadVoltage > EXT_LOAD_VOLTAGE_THRESHOLD_V){
			wasExternalVoltageAboveThreshold = 1;
		}

		// Send switch on veto
		if((TIMER_COUNTER_1MS > (canLastMessageTimestamp + CAN_MINIMAL_MESSAGE_TIME + (rand() % 4)))){
			can_status = 1;
			if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
				can_status = CAN_TX_Request(BMS_CLASS_MASK+1, BMS_SwitchOn_Veto, targetData, 2);
			}
			else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
				can_status = CAN_TX_Request(BMS_CLASS_MASK  , BMS_SwitchOn_Veto, targetData, 2);
			}
			if(can_status == CY_CANFD_SUCCESS){
				switchOnVetoSendSuccessCounter++;
			}
		}

		// Keep analog frontend TLE9012 communication alive
		manage_analogFrontendTLE9012();

		// Limit loop time
		cyhal_system_delay_ms(25);
	}

	// Print result of acquisition
	PRINTF_MAIN_DEBUG("\tInitial slot state %d stayed constant = %d. External load voltage above threshold = %d. Switch on veto send successful = %d (own SoC %d). Switch on veto received = %d (SoC other BMS = %d)\r\n", hotSwap_initialSlotState, wasSlotStateConstantOnASystem, wasExternalVoltageAboveThreshold, switchOnVetoSendSuccessCounter, targetData[0], wasSwitchOnVetoReceived, switchOnVetoReceivedSocOtherBMS);

