Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
	/// Check in which state the BMS should start. The first two condition are used to detect definitive states, the rest detects special states on to of them
	// Shutdown condition - slot changed during init
	if(wasSlotStateConstantOnASystem == 0){
		PRINTF_MAIN_DEBUG("\tState can not be determined - shutdown system. Slot state did not stay constant during hotswap init\r\n");
		statusBMS.hotSwapRole = HOTSWAP_ERROR;
		shutdownSystem();
	}
	// Explicit TAKER condition - Always wait for takeover if external load voltage is detected
	else if(wasExternalVoltageAboveThreshold == 1 && (hotSwap_initialSlotState == SLOT_IN_SYSTEM_1 || hotSwap_initialSlotState == SLOT_IN_SYSTEM_2)){
		PRINTF_MAIN_DEBUG("\tState explicitly TAKER. Slot state stayed constant, but external load voltage was detected\r\n");
		statusBMS.hotSwapRole = HOTSWAP_TAKER;
	}
	// Explicit MAIN/GIVER condition - No switchOnVeto CAN message received and not able to send any (there is no second BMS)
	else if((hotSwap_initialSlotState != SLOT_IN_SYSTEM_1) && (hotSwap_initialSlotState != SLOT_IN_SYSTEM_2)){
		PRINTF_MAIN_DEBUG("\tState explicitly MAIN. Slot state stayed constant and no external load voltage was detected, but system is not in a system slot\r\n");
		statusBMS.hotSwapRole = HOTSWAP_MAIN;
	}
	else if(wasSwitchOnVetoReceived == 0 && switchOnVetoSendSuccessCounter <= 1){
		PRINTF_MAIN_DEBUG("\tState explicitly MAIN. Slot state stayed constant and no external load voltage was detected, but no switch ON veto received and switch ON veto sending was not successful\r\n");
		statusBMS.hotSwapRole = HOTSWAP_MAIN;
	}
	// TAKER condition, second BMS startup - A second BMS is active but did not enable output yet
	else if(switchOnVetoReceivedActiveStateOtherBMS == 1){
		PRINTF_MAIN_DEBUG("\tState second BMS TAKER. Slot state stayed constant, no external load voltage was detected, switch ON veto received, but other BMS sends active flag\r\n");
		statusBMS.hotSwapRole = HOTSWAP_TAKER;
	}
	// Both BMS want to be active - determine hotswap role
	else if(wasSwitchOnVetoReceived == 1 && switchOnVetoSendSuccessCounter > 1){
		if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
			PRINTF_MAIN_DEBUG("\tState MAIN. Slot state stayed constant and no external load voltage was detected, switch ON veto received, switch ON veto sending successful, but BMS is in main slot 1\r\n");
			statusBMS.hotSwapRole = HOTSWAP_MAIN;
		}
		else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
			PRINTF_MAIN_DEBUG("\tState TAKER. Slot state stayed constant and no external load voltage was detected, switch ON veto received, switch ON veto sending successful, but BMS is in main slot 2\r\n");
			statusBMS.hotSwapRole = HOTSWAP_TAKER;
		}
		else{
			PRINTF_MAIN_DEBUG("\t[ERROR]: BMS not in system\r\n");
			statusBMS.hotSwapRole = HOTSWAP_ERROR;
			shutdownSystem();
		}
	}
	else{
		PRINTF_MAIN_DEBUG("\t[ERROR]: HotSwap init encountered not handled condition, make sure that there is no CAN sniffer active (would ack switch on veto messages but does not reply)\r\n");
		statusBMS.hotSwapRole = HOTSWAP_ERROR;
		shutdownSystem();
	}


	// If role allows switch on send a first switch on veto message with value set to max to signal that this BMS will try to switch on
	if(statusBMS.hotSwapRole == HOTSWAP_MAIN){
		cyhal_system_delay_ms(5);
		targetData[0] = 255;
		targetData[1] = 1; // Set active state off

		// Try to send message 3 times
		can_status = 1;
		for(int i = 0; i < 3; i++){
			if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
				can_status = CAN_TX_Request(BMS_CLASS_MASK+1, BMS_SwitchOn_Veto, targetData, 2);
			}
			else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
				can_status = CAN_TX_Request(BMS_CLASS_MASK  , BMS_SwitchOn_Veto, targetData, 2);
			}
			cyhal_system_delay_ms(CAN_MINIMAL_MESSAGE_TIME + (rand() % 4));

			//
			if(can_status == CY_CANFD_SUCCESS){
				PRINTF_MAIN_DEBUG("\tSent switch ON veto successful\r\n");
				break;
			}

		}

		// Reset can message counter so that system is in known state (especially switch on veto counter would trigger ERR_INT_SWITCH_ON_VETO_RECEIVED if not reset)
		resetCanMessageCounters();
	}

}

void init_batteryState(){
	PRINTF_MAIN_DEBUG("Init battery state monitoring:\r\n");
	// Init battery state detection (SoC & SoH)
	statusBMS.SoC = init_battery_state(&batteryState, setupBMS.BatteryRatedCapacity, statusBMS.voltage, setupBMS.NumCells);
	statusBMS.SoH = batteryState.SoH_t0; // For the time being - will later be replaced with a stored SoH value
	PRINTF_MAIN_DEBUG("\tSoC_t0 %.3f, capacity_init %.3fmAh, voltage_init %.3f, SoH_lower_threshold_V %.3f, SoH_upper_threshold_V %.3f, capacity_range_SoH %.3f\r\n", batteryState.SoC_t0, batteryState.capacity_init/3.6, batteryState.voltage_init, batteryState.SoH_lower_threshold_V, batteryState.SoH_upper_threshold_V, batteryState.capacity_range_SoH);
}

//****************************************************************************
// init_analogFrontendTLE9012 - Initialize communication with the analog frontend TLE9012, configure it, read initial data and refresh tle9012 watchdog s it does not turn of before main loop starts
//****************************************************************************
requestResult init_analogFrontendTLE9012(){
	PRINTF_MAIN_DEBUG("TLE9012 analog frontend:\r\n");

	// Wake devices and init ID etc
	//requestResult tle9012_result;
	tle9012_deviceInit(0);
	cyhal_system_delay_ms(10);

	/// TLE9012 initial configuration
	// PART_CONFIG: Enable monitoring for all cells
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, PART_CONFIG, 0x0FFF, 1, 0), tle9012_writeRegisterByIndex_PART_CONFIG , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// MEAS_CTRL: Configure and trigger measurement of Block and Primary Cell Voltage
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, MEAS_CTRL, CVM_DEL__1 | PBOFF__BAL_INTERRUPT | BVM_MODE__16_BIT | BVM_START__TRIG_MEAS | CVM_MODE__16_BIT | PCVM_START__TRIG_MEAS, 1, 0), tle9012_writeRegisterByIndex_MEAS_CTRL , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// OP_MODE: Extended watchdog and Diagnostics currents enabled for all channels WARNING: SOME SETTINGS MIGHT RESULT IN THE SYSTEM NOT STARTING PROPERLY IF THEY ARE NOT MANUALLY RESET BEFORE SHUTDOWN
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, OP_MODE, PD__NORMAL_OP | EXT_WD__NOT_ACTIVE | SLEEP_REG_RESET__NORMAL_OP | I_DIAG_EN__OFF | LR_TIME__DEFAULT, 1, 0), tle9012_writeRegisterByIndex_OP_MODE , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// FAULT_MASK: Decide which errors trigger the ERR pin to rise and TLE9012 interrupt to trigger
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, FAULT_MASK, ERR_PIN__ENABLE | M_ADC_ERR__ENABLE | M_OL_ERR__ENABLE | M_INT_IC_ERR__ENABLE | M_REG_CRC_ERR__ENABLE | M_EXT_T_ERR__ENABLE | M_INT_OT__ENABLE | M_CELL_UV__ENABLE | M_CELL_OV__ENABLE | M_BAL_ERR_UC__ENABLE | M_NR_ERR_BAL_OC__ENABLE, 1, 0), tle9012_writeRegisterByIndex_FAULT_MASK , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

