Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
	// OL_OV_THR: Cell overvoltage and maximum open loop voltage drop threshold
	uint16_t ov_thr     = (uint16_t)((((float)setupBMS.LimitOverVoltageCell)/1000.0)/CELL_OVUV_LSB);
	uint16_t ol_thr_max = (uint16_t)(OPEN_LOOP_MAX_V_THRESHOLD/CELL_OVUV_LSB);
	//PRINTF_MAIN_DEBUG("Set ov_thr %d, ol_thr_max %d => %d\r\n", ov_thr, ol_thr_max, ov_thr | (ol_thr_max  << 10));
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, OL_OV_THR, ov_thr | (ol_thr_max  << 10), 1, 0), tle9012_writeRegisterByIndex_OL_OV_THR , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// OL_UV_THR: Cell undervoltage and minimum open loop voltage drop threshold
	uint16_t uv_thr     = (uint16_t)((((float)(setupBMS.LimitUnderVoltageCell))/1000.0)/CELL_OVUV_LSB);
	uint16_t ol_thr_min = (uint16_t)(OPEN_LOOP_MIN_V_THRESHOLD/CELL_OVUV_LSB);
	//PRINTF_MAIN_DEBUG("Set uv_thr %d, ol_thr_min %d => %d\r\n", uv_thr, ol_thr_min, uv_thr | (ol_thr_min  << 10));
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, OL_UV_THR, uv_thr | (ol_thr_min  << 10), 1, 0), tle9012_writeRegisterByIndex_OL_UV_THR , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// TEMP_CONF: Enable all temperature sensors
	uint16_t e_overtmp_th = tle9012_convertExternalTemperatureThreshold(TLE9012_EXTERNAL_OVERTEMP_C, I_NTC__I_0);
	PRINTF_MAIN_DEBUG("\tSet external overtemperature threshold to %d\r\n", e_overtmp_th);
	//uint16_t e_overtmp_th = 0;
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, TEMP_CONF, e_overtmp_th | I_NTC__I_0 | NR_TEMP_SENSE__TMP0_4, 1, 0), tle9012_writeRegisterByIndex_TEMP_CONF , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// INT_OT_WARN_CONF: Configure internal overtemperature
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, INT_OT_WARN_CONF, (-TLE9012_INTERNAL_OVERTEMP_C+547.3F)/TEMP_INT_LSB, 1, 0), tle9012_writeRegisterByIndex_INT_OT_WARN_CONF , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// BAL_PWM: Set the balancing PWM to 0 (off)
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, BAL_PWM, 0, 1, 0), tle9012_writeRegisterByIndex_BAL_PWM , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// BAL_CURR_THR:
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, BAL_CURR_THR, OC_THR__DEFAULT | UC_THR__DEFAULT , 1, 0), tle9012_writeRegisterByIndex_BAL_CURR_THR , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// BAL_SETTINGS: Disable all balancing switches
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, BAL_SETTINGS, 0, 1, 0), tle9012_writeRegisterByIndex_BAL_SETTINGS , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// RR_CONFIG: Enable error counter for all errors except balancing overcurrent (as per default)
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, RR_CONFIG,
			RR_CNT__RR_36 |
			RR_SYNC__NO_SYNC |
			M_NR_ERR_ADC_ERR__DISABLE |
			M_NR_ERR_OL_ERR__DISABLE |
			M_NR_ERR_EXT_T_ERR__DISABLE |
			M_NR_ERR_INT_OT__DISABLE |
			M_NR_ERR_CELL_UV__DISABLE |
			M_NR_ERR_CELL_OV__DISABLE |
			M_NR_ERR_BAL_UC__DISABLE |
			M_NR_ERR_BAL_OC__ENABLE, 1, 0), tle9012_writeRegisterByIndex_RR_CONFIG , SUCCESS_FUNCTION_NONE);
	if (tle9012_print_if_error_result >= REQUEST_ERROR){ return tle9012_print_if_error_result; }

	// Set the multi-read configuration
	requestResult res = tle9012_writeMultiReadConfig(1, PCVM_SEL__RES_CELL_11_0, BVM_SEL__RESULT, EXT_TEMP_SEL__RES_TMP0_4, EXT_TEMP_R_SEL__NO_R_DIAG_RES, INT_TEMP_SEL__INT_TMP_RES, SCVM_SEL__RESULT, STRESS_PCVM_SEL__RESULT, 1 );
	if (res >= REQUEST_ERROR){ return res; }

	// Leave time for settings to take effect
	cyhal_system_delay_ms(300); //90

	// Read all registers to cache
	TLE9012_DETECT_COM_ERROR( tle9012_readAllRegistersToCache(1, 1, 0), tle9012_readAllRegistersToCache , SUCCESS_FUNCTION_NONE);

	/// Print configuration registers
	tle9012_printRegister(1, OP_MODE);
	tle9012_printRegister(1, RR_CONFIG);
	tle9012_printRegister(1, BAL_CURR_THR);
	tle9012_printRegister(1, MEAS_CTRL);
	tle9012_printRegister(1, CONFIG_MAIN);
	tle9012_printRegister(1, FAULT_MASK);
	tle9012_printRegister(1, MULTI_READ_CFG);

	/// Diagnostic: Read, write and print register for first time
	// Read and print errors
	TLE9012_DETECT_COM_ERROR( tle9012_readRegisterByIndex(1, GEN_DIAG, 1, 0), tle9012_readRegisterByIndex_GEN_DIAG , SUCCESS_FUNCTION_NONE);
	tle9012_printRegister(1, GEN_DIAG);
	// Clear tle9012 errors for the first time
	TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, GEN_DIAG, 0x0000, 1, 0), tle9012_writeRegisterByIndex_GEN_DIAG , SUCCESS_FUNCTION_NONE);

	// Convert BVM, PCVM, TEMP values and print them
	TLE9012_DETECT_COM_ERROR( tle9012_convertPrimaryCellVoltages(1, 0, 11, 0), tle9012_convertPrimaryCellVoltages , SUCCESS_FUNCTION_NONE);
	TLE9012_DETECT_COM_ERROR( tle9012_convertBlockVoltage(1, 0), convertBlockVoltage , SUCCESS_FUNCTION_NONE);
	TLE9012_DETECT_COM_ERROR( tle9012_convertTemperatures(1, 4, 1), tle9012_convertTemperatures , SUCCESS_FUNCTION_NONE);
	TLE9012_DETECT_COM_ERROR( tle9012_convertInternalTemperatureByIndex(1, 0, 0), tle9012_convertInternalTemperatures_0 , SUCCESS_FUNCTION_NONE);
	TLE9012_DETECT_COM_ERROR( tle9012_convertInternalTemperatureByIndex(1, 1, 0), tle9012_convertInternalTemperatures_1 , SUCCESS_FUNCTION_NONE);
	// Print voltage and temperature
	PRINTF_MAIN_DEBUG("Initial TLE9012 measurements: \r\n");
	PRINTF_MAIN_DEBUG("\tBVM:    %2.3lf V \r\n", tle9012_nodes[0].block_voltage);
	for(uint8_t i = 0; i < NUM_CELLS; i++){
		PRINTF_MAIN_DEBUG("\tPCVM:    %2.3lf V \r\n", (double)(tle9012_nodes[0].cell_voltages[i])/1000.0);
		sh_pub_cells[i] = tle9012_nodes[0].cell_voltages[i];
	}
	for(int i = 0; i <= 4; i++){
		PRINTF_MAIN_DEBUG("\tTemp %d: %2.3lf C \r\n", i, tle9012_nodes[0].temperatures[i]);
	}
	PRINTF_MAIN_DEBUG("\tTempInt 0: %2.3lf C \r\n", tle9012_nodes[0].temperaturesInternal[0]);
	PRINTF_MAIN_DEBUG("\tTempInt 1: %2.3lf C \r\n", tle9012_nodes[0].temperaturesInternal[1]);

