Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
	// Set initial values
	sh_pub_volt = (uint16_t)(tle9012_nodes[0].block_voltage*1000.0);
	statusBMS.voltage = (float)tle9012_nodes[0].block_voltage;
	statusBMS.avgTemp = (float)(tle9012_nodes[0].temperatures[0] + tle9012_nodes[0].temperatures[3])/2; // Calculate the average temperature between cell temperature sensors
	statusBMS.avgCellVolt_mV = UINT16_MAX;

	// Send a watchdog update because the next steps till the main loop enters could take longer than wake time. NOTE: This is only allowed here because the last command was executed blocking and is is therefore sure that no data can be received during the update (see comment in sendWatchdogUpdate())
	cyhal_system_delay_ms(300); // Todo: This delay might not be needed
	sendWatchdogUpdate(1, 1);

	// Success
	return REQUEST_OK;
}

//****************************************************************************
// processMeasurements - Manages the measurement and conversion of analog frontend (cell voltage, block voltage temperatures and everything in multiread), external ADC (current and load voltage) and internal ADC.
//						 Note that the current measurement is triggered in the same cycle as the analog frontend measurements, as long as they are not slower
//****************************************************************************
void processMeasurements(){
	// Reset flag that notices rest of code that the result are ready
	isTLE9012ResultReceivedThisCycle = 0;

	// TLE9012 analog frontend measurement processing state machine -> Cell/block voltage, temperature, diagnostic, etc (see call of tle9012_writeMultiReadConfig() in init)
	requestResult tle9012_result;
	switch (statusBMS.measurementState) {
		case MEASUREMENT_WAIT_RESULT:
			// Check the MEAS_CTRL control register until the trigger bit is gone (in this case the measurement is finished)

			// If MEAS_CTRL is not queued anymore read is finished
			if(checkRegisterQueued_tle9012(1, MEAS_CTRL, 0) == 0){
				// If the PCVM and BVM Start measurement bit is gone trigger MULTI_READ, else trigger next read of MEAS_CTRL
				if((getRegisterCacheDataByIndex_tle9012(1, MEAS_CTRL) & (MEAS_CTRL__PCVM_START.mask | MEAS_CTRL__BVM_START.mask)) == 0){
					PRINTF_MEASUREMENT("Measurement finished - Queue next multi read\r\n");

					// BALANCING: Write balancing map here as early as possible after measurement deactivated it, so it can balance till next measurement is triggered
					TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, BAL_SETTINGS, statusBMS.bal_cell_map, 1, 0), tle9012_writeRegisterByIndex_BAL_SETTINGS , SUCCESS_FUNCTION_NONE);

					// Trigger multi-read of necessary registers
					tle9012_result = tle9012_readRegisterByIndex(1, MULTI_READ, 0, 0);
					if(tle9012_result >= REQUEST_ERROR){ PRINTF_MAIN_DEBUG("[ERROR]: Trigger next multi read returned %d\r\n", tle9012_result);}

					// Change State to wait for the result
					statusBMS.measurementState = MEASUREMENT_READ_RESULT;
				}
				// If the start bits are not gone yet trigger another read
				else{
					PRINTF_MEASUREMENT("Measurement not finished - Queue measurement control again\r\n");

					// Read measurement control register again till start bit is gone
					tle9012_result = tle9012_readRegisterByIndex(1, MEAS_CTRL, 0, 0);
					if(tle9012_result >= REQUEST_ERROR){ PRINTF_MAIN_DEBUG("[ERROR]: Read MEAS_CTRL returned %d\r\n", tle9012_result);}
				}
			}
			return;

			break;
		case MEASUREMENT_READ_RESULT:
			// If the minimal sample time is exceeded trigger next measurement
			// MULTI READ TLE9012:  Read and evaluate voltages
			if(checkRegisterQueued_tle9012(1, MULTI_READ, 0) == 0){
				PRINTF_MEASUREMENT("Multi read done\r\n");

				// Convert latest raw data and write converted data to display
				// BVM - Voltage of pack and write the result to statusBMS if successful
				TLE9012_DETECT_COM_ERROR( tle9012_convertBlockVoltage(1, 1)                 , tle9012_convertBlockVoltage , statusBMS.voltage = (float)tle9012_nodes[0].block_voltage);

				// PCVM - Primary cell voltage = voltage of each cell
				TLE9012_DETECT_COM_ERROR( tle9012_convertPrimaryCellVoltages(1, 0, 11, 1)   , tle9012_convertPrimaryCellVoltages          , SUCCESS_FUNCTION_NONE);

				// External Temperature
				TLE9012_DETECT_COM_ERROR( tle9012_convertTemperatures(1, 4, 1)              , tle9012_convertTemperatures                 , SUCCESS_FUNCTION_NONE);

				// Internal Temperature. NOTE: Only the first internal temperature sensor can be read with multi-read. Therefore the second one is ignored.
				TLE9012_DETECT_COM_ERROR( tle9012_convertInternalTemperatureByIndex(1, 0, 1), tle9012_convertInternalTemperatureByIndex_0 , SUCCESS_FUNCTION_NONE);
				//TLE9012_DETECT_COM_ERROR( tle9012_convertInternalTemperatureByIndex(1, 1, 1), tle9012_convertInternalTemperatureByIndex_1 , SUCCESS_FUNCTION_NONE);


				// Calculate the average temperature between cell temperature sensors
				float temp = (tle9012_nodes[0].temperatures[0] + tle9012_nodes[0].temperatures[3])/2;
				// Filter temperature and store it
				measure_movAvgFilter_fast(&avgFilter_tempCell, temp);
				statusBMS.avgTemp = avgFilter_tempCell.filterResult;

				// Calculate the average cell voltage
				statusBMS.avgCellVolt_mV = (uint16_t)((statusBMS.voltage/(float)NUM_CELLS)*1000);

				// Change State to wait for the result
				statusBMS.measurementState = MEASUREMENT_TRIGGER_NEXT;
				//return;
			}
			break;
		case MEASUREMENT_TRIGGER_NEXT:
			PRINTF_MEASUREMENT("Trigger next measurement\r\n");

			// Wait till the next measurement interval is reached. Note that there is a different interval while charging because the trigger is deactivating the balancing. Therefore the effectiveness of the balancing is improved by measuring slower while charging.
			if( (statusBMS.bms_state == BMS_CHARGING && (TIMER_COUNTER_1MS > (lastTLE9012MeasurementTimestamp + TLE9012_MEASURE_CHARGE_TIME))) ||
				(statusBMS.bms_state != BMS_CHARGING && (TIMER_COUNTER_1MS > (lastTLE9012MeasurementTimestamp + TLE9012_MEASURE_TIME))) ){
				//printf("Measurement time: %ud\r\n", TIMER_COUNTER_1MS-lastTLE9012MeasurementTimestamp);
				lastTLE9012MeasurementTimestamp = TIMER_COUNTER_1MS;

				// Mark that the result of the measurement can be used this cycle. This will trigger e.g. manage of balancing
				isTLE9012ResultReceivedThisCycle = 1;

				// Trigger next measurement and set
				TLE9012_DETECT_COM_ERROR( tle9012_writeRegisterByIndex(1, MEAS_CTRL, (CVM_DEL__1*2) | PBOFF__BAL_INTERRUPT | BVM_MODE__16_BIT | BVM_START__TRIG_MEAS | CVM_MODE__16_BIT | PCVM_START__TRIG_MEAS, 1, 0), MEAS_CTRL_trigger_measurement , SUCCESS_FUNCTION_NONE);

				if(TriggerCurrentMeasurement == 1) PRINTF_MAIN_DEBUG("[ERROR]: processMeasurements tried to trigger next AF before ADC result was ready\r\n");

