Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
				// Mark that the analog frontend measurement was triggered and trigger measurement of current in this cycle
				TriggerCurrentMeasurement = 1;

				// Change State to wait for the result
				statusBMS.measurementState = MEASUREMENT_WAIT_RESULT;
			}
			//return;
			break;
		default:
			PRINTF_MAIN_DEBUG("[ERROR]: processMeasurements reached invalid state\r\n");
			statusBMS.measurementState = MEASUREMENT_TRIGGER_NEXT;
			break;
	}


	// Read external ADC and trigger next conversion -> Accurate current and output/load voltage measurement (current measurement will trigger in the same cycle as analog frontend TLE9012)
	manage_external_ADC_MCP3465(1);

	// Read internal ADC and trigger next conversion -> Rough driver current and slot coding resistor voltage measurement
	manage_internal_ADC();
}

//****************************************************************************
// In no error condition determine BMS_STATE charge direction and try to keep switch on (with precharge and minimum restart timer).
// In error condition keep switch off. Also controls orange LED (blink during precharge, on when conducting, off when error) and statusBMS.outputState
//****************************************************************************
void manage_SystemAndSwitchState(){
	uint8_t targetData[6];
	targetData[0] = 0;

	// Get switch state
	uint8_t isSwitch_mainpath_ON  = getSwitchState_mainpath(USE_REG_RENEW_SS);   //uint8_t isSwitch_mainpath_ON = getStateChannelA(USE_REG_RENEW);
	uint8_t isSwitch_precharge_ON = getSwitchState_precharge(USE_REG_CACHED_SS); //uint8_t isSwitch_precharge_ON = getStateChannelB(USE_REG_CACHED);

	/// Control orange LED directly based on output paths state
	if(isSwitch_mainpath_ON){ // Main (low resistance) path
		// Turn on orange LED
		cyhal_gpio_write(BMS_LED2_OR, 1);
		statusBMS.outputState = OUTPUT_ON;
		blinkTimeLedOrange = 0;
	}
	else if(isSwitch_precharge_ON){ // Precharge path
		// Blink Orange LED
		if(TIMER_COUNTER_1MS > (switchPrechargeStartTimestamp + blinkTimeLedOrange)){
			cyhal_gpio_toggle(BMS_LED2_OR);
			blinkTimeLedOrange += BLINK_TIME_LED_ORANGE;
		}
		statusBMS.outputState = OUTPUT_PRECHARGE;
	}
	else{
		// Turn off orange LED
		cyhal_gpio_write(BMS_LED2_OR, 0);
		statusBMS.outputState = OUTPUT_OFF;
		blinkTimeLedOrange = 0;
	}

	/// State and Switch Control
	// If BMS is plugged in and in a operational state, evaluate BMS state and manage switch, else keep switch off
	if((statusBMS.bms_state == BMS_CHARGING || statusBMS.bms_state == BMS_DISCHARGING || statusBMS.bms_state == BMS_IDLE) && (statusBMS.slotState != SLOT_NONE)){

		// Check if BMS is charging or discharging
		if((statusBMS.slotState == SLOT_IN_SYSTEM_1 || statusBMS.slotState == SLOT_IN_SYSTEM_2) && statusBMS.bms_state != BMS_DISCHARGING){ //(statusBMS.current      >  IDLE_CURRENT_THRESHOLD)
			statusBMS.bms_state = BMS_DISCHARGING;
		}
		else if(statusBMS.slotState == SLOT_IN_CHARGER && statusBMS.bms_state != BMS_CHARGING){ //(statusBMS.current < -IDLE_CURRENT_THRESHOLD)
			statusBMS.bms_state = BMS_CHARGING;
		}
		// BMS_IDLE state is only used for transition to discharge or charge and must therefore never be set here

		// If shutdown is triggered and conditions are given initiate HotSwap
		if(isShutdownTriggered == 1 && statusBMS.hotSwapRole == HOTSWAP_MAIN && (isSwitch_mainpath_ON & isSwitch_precharge_ON) == 1){
			// Prepare bms state for takeover
			statusBMS.hotSwapRole = HOTSWAP_GIVER;
			statusBMS.giverHotSwapState = GIVER_SEND_HANDSHAKE;
			giverHotSwapTimestamp = TIMER_COUNTER_1MS;
			receivedCanHandshakeCount = 0;
			receivedCanSwapCount = 0;
			receivedCanFinishCount = 0;
			receivedCanSwitchOnVetoCount = 0;
		}
		else if(isShutdownTriggered == 1 && (statusBMS.hotSwapRole == HOTSWAP_TAKER || statusBMS.hotSwapRole == HOTSWAP_ERROR)){
			// Shut down normally, no hotswap needed
			PRINTF_MAIN_DEBUG("Direct shutdown - BMS is in HotSwap TAKER or ERROR\r\n");
			shutdownSystem();
		}
		else if( (getMsgBit(MSG_INT_EXT_LOAD_V_ON) == 0) && (statusBMS.hotSwapRole == HOTSWAP_TAKER) && TIMER_COUNTER_1MS > HOTSWAP_TAKER_SHUTDWN_VEXT_TIME){
			// If BMS is hotswap TAKER and the external voltage disappears, the BMS can never taker over -> shutdown
			PRINTF_MAIN_DEBUG("Direct shutdown - BMS is in HotSwap TAKER and external voltage disappeared - could never take over\r\n");
			shutdownSystem();
		}

		// State machine Switch on
		//// ---- MAIN ----
		if(statusBMS.hotSwapRole == HOTSWAP_MAIN){
			switch (statusBMS.switchState){
				case SWITCH_IDLE:
					// If one of the safety switch channels are not conducting and time since last turn on is greater than minimal ...
					if((isSwitch_mainpath_ON & isSwitch_precharge_ON) == 0 && ( (TIMER_COUNTER_1MS > (lastSwitchOnTimestamp + MOSFET_ON_RETRY_TIME)) || lastSwitchOnTimestamp == 0) && (getMsgBit(MSG_INT_EXT_LOAD_V_ON) == 0 || statusBMS.slotState == SLOT_IN_CHARGER)){
						// Limit number of switch on tries
						if(safety_switch_retry_counter >= SAFETY_SWITCH_RETRY_COUNT){
							statusBMS.bms_state = BMS_IDLE;
							statusBMS.outputState = OUTPUT_OFF_TILL_RESTART;
							return;
						}

						PRINTF_MAIN_DEBUG("Switch on CH_B - Precharge\r\n");

						// Reset latched error and warning bitmaps
						reset_latchedBitmaps(1, 0);

						// Make sure all channels are turned off
						setSwitchIsolating();

						// Store current time as last turn on time
						lastSwitchOnTimestamp = TIMER_COUNTER_1MS;

						// Store current time as precharge start time
						switchPrechargeStartTimestamp = TIMER_COUNTER_1MS;

						// Turn precharge path on
						isCurrentOffsetCalibrating = 0;
						setSwitchState_precharge(1); //switchCH_B_On(USE_REG_RENEW);

						// Set state machine switch to initialize switch on
						statusBMS.switchState = SWITCH_PRECHARGE;
					}

					break;

				case SWITCH_PRECHARGE:
					// If precharge time elapsed, switch all channels on
					if(TIMER_COUNTER_1MS > (switchPrechargeStartTimestamp + PRECHARGE_MIN_TIME)){
						if( (TIMER_COUNTER_1MS > (switchPrechargeStartTimestamp + PRECHARGE_MAX_TIME)) || (statusBMS.voltageChangeRate_ms < PRECHARGE_TARGET_V_CHANGE_RATE) ){
							if(TIMER_COUNTER_1MS > (switchPrechargeStartTimestamp + PRECHARGE_MAX_TIME)) { PRINTF_MAIN_DEBUG("Switch on CH_A - Main path (maximum precharge time exceeded after %ldms)\r\n", TIMER_COUNTER_1MS-switchPrechargeStartTimestamp);}
							if(statusBMS.voltageChangeRate_ms < PRECHARGE_TARGET_V_CHANGE_RATE)          { PRINTF_MAIN_DEBUG("Switch on CH_A - Main path (target voltage change rate reached after %ldms - min precharge time %dms)\r\n", TIMER_COUNTER_1MS-switchPrechargeStartTimestamp, PRECHARGE_MIN_TIME);}

							// Turn main path on
							isCurrentOffsetCalibrating = 0;
							setSwitchState_mainpath(1); //switchCH_A_On(USE_REG_RENEW);

							// Set statemachine switch to wait for switch off
							statusBMS.switchState = SWITCH_IDLE;
							// Signal to display on CM0+
							statusBMS.outputState = OUTPUT_ON;

							// Limit number of switch on tries
							safety_switch_retry_counter++;
						}
					}
					break;

				default:
					break;
			}
		}
		//// ---- GIVER ----
		else if(statusBMS.hotSwapRole == HOTSWAP_GIVER){
			switch (statusBMS.giverHotSwapState) {
				case GIVER_SEND_HANDSHAKE:
					PRINTF_HOT_SWAP("GIVER_SEND_HANDSHAKE - Send BMS_HS_Handshake (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));
					// Goto next state and reset timestamp
					statusBMS.giverHotSwapState = GIVER_WAIT_FOR_HANDSHAKE;
					giverHotSwapTimestamp = TIMER_COUNTER_1MS;
					break;
				case GIVER_WAIT_FOR_HANDSHAKE:
					// Send handshake continuously
					if((TIMER_COUNTER_1MS > (canLastMessageTimestamp + CAN_MINIMAL_MESSAGE_TIME + (rand() % 4)))){
						if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
							CAN_TX_Request(BMS_CLASS_MASK+1, BMS_HS_Handshake, targetData, 1);
						}
						else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
							CAN_TX_Request(BMS_CLASS_MASK, BMS_HS_Handshake, targetData, 1);
						}
					}
					// If handshake received Send command to reduce power
					if(receivedCanHandshakeCount >= 1){
						PRINTF_HOT_SWAP("GIVER_WAIT_FOR_HANDSHAKE - Received, Send BMS_ReducePowerForHS! (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));

						// Goto next state and reset timestamp
						statusBMS.giverHotSwapState = GIVER_WAIT_REDUCE_POWER;
						giverHotSwapTimestamp = TIMER_COUNTER_1MS;
					}
					else if(TIMER_COUNTER_1MS > (giverHotSwapTimestamp + HOTSWAP_TIMEOUT_TIME)){
						PRINTF_HOT_SWAP("GIVER_WAIT_FOR_HANDSHAKE - Timeout (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));
						shutdownSystem();
					}

					break;
				case GIVER_WAIT_REDUCE_POWER:
					// Send reduce power continuously
					if((TIMER_COUNTER_1MS > (canLastMessageTimestamp + CAN_MINIMAL_MESSAGE_TIME + (rand() % 4)))){
						CAN_TX_Request(BMS_ReducePowerForHS, BMS_ReducePowerForHS, targetData, 1);
					}
					// Give rest of system time to reduce power, then send swap command
					if(TIMER_COUNTER_1MS > (giverHotSwapTimestamp + HOTSWAP_WAIT_REDUCE_POWER_TIME)){
						PRINTF_HOT_SWAP("GIVER_WAIT_REDUCE_POWER - Send BMS_HS_Swap! (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));

						// Goto next state and reset timestamp
						statusBMS.giverHotSwapState = GIVER_WAIT_SWAP;
						giverHotSwapTimestamp = TIMER_COUNTER_1MS;
					}
					break;
				case GIVER_WAIT_SWAP:
					// Send swap continuously
					if((TIMER_COUNTER_1MS > (canLastMessageTimestamp + CAN_MINIMAL_MESSAGE_TIME + (rand() % 4)))){
						if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
							CAN_TX_Request(BMS_CLASS_MASK+1, BMS_HS_Swap, targetData, 1);
						}
						else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
							CAN_TX_Request(BMS_CLASS_MASK, BMS_HS_Swap, targetData, 1);
						}
					}

					// If swap received turn output of and send done
					if(receivedCanSwapCount >= 1){
						PRINTF_HOT_SWAP("GIVER_WAIT_SWAP - Received, output off and send BMS_HS_Finish! (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));

