Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
						// Turn output off
						setSwitchIsolating();

						// Send done message 5 times
						for(uint8_t i = 0; i < 5; i++){
							if((TIMER_COUNTER_1MS > (canLastMessageTimestamp + CAN_MINIMAL_MESSAGE_TIME + (rand() % 4)))){
								if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
									CAN_TX_Request(BMS_CLASS_MASK+1, BMS_HS_Finish, targetData, 1);
								}
								else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
									CAN_TX_Request(BMS_CLASS_MASK, BMS_HS_Finish, targetData, 1);
								}
								cyhal_system_delay_ms(HOTSWAP_CAN_MSG_DELAY_TIME);
							}
						}
						// Shutdown system
						PRINTF_HOT_SWAP("GIVER_WAIT_SWAP - Finished, shutdown! (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));
						shutdownSystem();
					}
					else if(TIMER_COUNTER_1MS > (giverHotSwapTimestamp + HOTSWAP_TIMEOUT_TIME)){
						PRINTF_HOT_SWAP("GIVER_WAIT_SWAP - Timeout (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));
						shutdownSystem();
					}
					break;
			}

			// During give sequence the main loop is delayed
			cyhal_system_delay_ms(HOTSWAP_CAN_MSG_DELAY_TIME);
		}
		//// ---- TAKER ----
		else if(statusBMS.hotSwapRole == HOTSWAP_TAKER){
			switch (statusBMS.takerHotSwapState) {
				case TAKER_WAIT_FOR_HANDSHAKE:
					// If handshake received send handshake command back
					if(receivedCanHandshakeCount >= 1){
						PRINTF_HOT_SWAP("TAKER_WAIT_FOR_HANDSHAKE - Received, Send BMS_HS_Handshake! (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));

						// Goto next state and reset timestamp
						statusBMS.takerHotSwapState = TAKER_WAIT_SWAP;
						takerHotSwapTimestamp = TIMER_COUNTER_1MS;
					}

					break;
				case TAKER_WAIT_SWAP:
					// Send handshake continuously
					if((TIMER_COUNTER_1MS > (canLastMessageTimestamp + CAN_MINIMAL_MESSAGE_TIME + (rand() % 4)))){
						if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
							CAN_TX_Request(BMS_CLASS_MASK+1, BMS_HS_Handshake, targetData, 1);
						}
						else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
							CAN_TX_Request(BMS_CLASS_MASK, BMS_HS_Handshake, targetData, 1);
						}
					}

					// If swap received turn on precharge and send command swap back
					if(receivedCanSwapCount >= 1){
						setSwitchState_precharge(1);
						PRINTF_HOT_SWAP("TAKER_WAIT_SWAP - Received, turn on precharge and send BMS_HS_Swap! (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));

						// Goto next state and reset timestamp
						statusBMS.takerHotSwapState = TAKER_WAIT_FINISH;
						takerHotSwapTimestamp = TIMER_COUNTER_1MS;
					}
					else if(TIMER_COUNTER_1MS > (takerHotSwapTimestamp + HOTSWAP_TIMEOUT_TIME + HOTSWAP_WAIT_REDUCE_POWER_TIME)){
						PRINTF_HOT_SWAP("TAKER_WAIT_SWAP - Timeout  %ld %ld %d\r\n", TIMER_COUNTER_1MS, takerHotSwapTimestamp, HOTSWAP_TIMEOUT_TIME);
						shutdownSystem();
					}

					break;
				case TAKER_WAIT_FINISH:
					// Send swap continuously
					if((TIMER_COUNTER_1MS > (canLastMessageTimestamp + CAN_MINIMAL_MESSAGE_TIME + (rand() % 4)))){
						if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
							CAN_TX_Request(BMS_CLASS_MASK+1, BMS_HS_Swap, targetData, 1);
						}
						else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
							CAN_TX_Request(BMS_CLASS_MASK, BMS_HS_Swap, targetData, 1);
						}
					}

					// If done received turn on full and go into MAIN mode
					if(receivedCanFinishCount >= 1){
						PRINTF_HOT_SWAP("TAKER_WAIT_FINISH - Received, turn on full and goto MAIN mode! (A%d B%d)\r\n", getSwitchState_mainpath(USE_REG_RENEW_SS), getSwitchState_precharge(USE_REG_RENEW_SS));
						setSwitchState_mainpath(1); //switchCH_A_On(USE_REG_RENEW);

						// Goto default state and reset timestamp
						statusBMS.takerHotSwapState = TAKER_WAIT_FOR_HANDSHAKE;
						takerHotSwapTimestamp = TIMER_COUNTER_1MS;

						// Clear robot to use power again
						for(uint8_t i = 0; i < 5; i++){
							if((TIMER_COUNTER_1MS > (canLastMessageTimestamp + CAN_MINIMAL_MESSAGE_TIME + (rand() % 4)))){
								CAN_TX_Request(BMS_EnablePowerForHS, BMS_EnablePowerForHS, targetData, 1);
								cyhal_system_delay_ms(HOTSWAP_CAN_MSG_DELAY_TIME);
							}
						}

						// Reset can message counter so that system is in known state (especially switch on veto counter would trigger ERR_INT_SWITCH_ON_VETO_RECEIVED if not reset)
						resetCanMessageCounters();

						// Change to MAIN mode
						statusBMS.hotSwapRole = HOTSWAP_MAIN;

						// Set statemachine switch to wait for switch off
						statusBMS.switchState = SWITCH_IDLE;
						// Signal to display on CM0+
						statusBMS.outputState = OUTPUT_ON;

						// Limit number of switch on tries
						safety_switch_retry_counter++;
					}
					else if(TIMER_COUNTER_1MS > (takerHotSwapTimestamp + HOTSWAP_TIMEOUT_TIME)){
						PRINTF_HOT_SWAP("TAKER_WAIT_FINISH - Timeout \r\n");
						setSwitchState_precharge(0); //switchCH_B_Off(USE_REG_RENEW);
						shutdownSystem();
					}

					break;
			}

			// During give the main loop is delayed
			cyhal_system_delay_ms(HOTSWAP_CAN_MSG_DELAY_TIME);
		}
	}
	// Output off condition
	else if(((isSwitch_mainpath_ON | isSwitch_precharge_ON) == 1) || (statusBMS.bms_state != BMS_ERROR && statusBMS.bms_state != BMS_IDLE)){
		//PRINTF_MAIN_DEBUG("Switch off --- slot state %d, bms state %d \r\n", statusBMS.slotState, statusBMS.bms_state);
		PRINTF_MAIN_DEBUG("Switch off \r\n");

		// Disable MOSFETs/current flow in any other case
		setSwitchIsolating();

		// Reset state machine switch to check and try switch on when error clears
		statusBMS.switchState = SWITCH_IDLE;

		// Change state to idle if needed
		if(statusBMS.slotState == SLOT_NONE && statusBMS.bms_state != BMS_IDLE && statusBMS.bms_state != BMS_ERROR){
			PRINTF_MAIN_DEBUG("BMS_IDLE state set (was %d)\r\n", statusBMS.bms_state);
			statusBMS.bms_state = BMS_IDLE;
		}

		// Signal to display on CM0+
		if(safety_switch_retry_counter >= SAFETY_SWITCH_RETRY_COUNT){
			statusBMS.outputState = OUTPUT_OFF_TILL_RESTART;
		}
		else{
			statusBMS.outputState = OUTPUT_READY;
		}
	}
}

//****************************************************************************
// manage_analogFrontendTLE9012 - Execute queue management and interpretation of received data from anlog frontend. This also keeps the IC awake.
//                 See comment of tle9012_manageQueue and tle9012_manageInterpreter
//****************************************************************************
void manage_analogFrontendTLE9012(){
	// If init was not successful always report fail to signal error (and make system never switch on)
	if(initTLE9012Error == 1){
		lastQueueResult_tle9012 = QUEUE_FAIL;
	}
	// Else check TLE9012 queue and interpreter
	else{
		lastQueueResult_tle9012 = tle9012_manageQueue(1);
		tle9012_manageInterpreter();
	}
}

//****************************************************************************
// manage_external_ADC_MCP3465 - Read and trigger measurement of external adc subsequently for both channels
// returns 0 if measurement was not ready, 1 if current was read and 2 if external voltage was read
//****************************************************************************
uint8_t manage_external_ADC_MCP3465(uint8_t waitForCurrentMeasTrigger){
	uint8_t STATUS_DATA;
	uint16_t SGN_DATA, DATA;

	// Activate SPI and check status of ADC
    set_CS_SPI_LOW();
    STATUS_DATA = RETRIEVE_STATUS();
    set_CS_SPI_HIGH();

    // While waiting for the current measurement trigger do nothing. When it is set trigger the next measurement
	if(activeChannelExternalADC == ACTIVE_EXT_ADC_WAIT_FOR_CURRENT_TRIGGER){
		if(TriggerCurrentMeasurement == 1){
			// Trigger ADC Conversion on channel 0 current
			SPI_WRT(_MUX_, MUX_CFG_CH0_SINGLE_END);
			activeChannelExternalADC = ACTIVE_EXT_ADC_CH0_CURRENT;
			//PRINTF_MAIN_DEBUG("\tCurrent measurement triggered by TLE9012\r\n");

			// Reset flag
			TriggerCurrentMeasurement = 0;
		}
		return 0;
	}

    // Wait till the Data-Ready(DR) Bit of STATUS Byte is set
	if (STATUS_DATA == 0x13) {
    	// Mark time of last successful read. Used to detect timeout error if communication fails for to long (diagnostic.c)
    	//PRINTF_MAIN_DEBUG("\tExternal ADC CH %d received after %lu ms\r\n", activeChannelExternalADC, TIMER_COUNTER_1MS-adcExtLastReadSuccessTimestamp); // Use this for ADC sample time measurement
    	adcExtLastReadSuccessTimestamp = TIMER_COUNTER_1MS;


