Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
    	// Activate SPI and get result data from ADC
    	set_CS_SPI_LOW();
    	STATUS_DATA = spiTransfer((_ADCDATA_ << 2) | _RD_CTRL_);
    	// Get sign of data
        SGN_DATA = (spiTransfer(0x00) << 8);
        SGN_DATA |= (spiTransfer(0x00) & 0x00FF);
        //Get actual data and deactivate SPI
        DATA = (spiTransfer(0x00) << 8);
        DATA |= (spiTransfer(0x00) & 0x00FF);
        set_CS_SPI_HIGH();

        // Depending on which channel is currently active store result for it and trigger the other one
        if (activeChannelExternalADC == ACTIVE_EXT_ADC_CH0_CURRENT) {
        	// Determine raw value based on signedness
        	int32_t system_I_raw = 0;
        	if (SGN_DATA == 0xFFFF) {
        		system_I_raw = (65536 - (float) DATA);
        	} else if (SGN_DATA == 0x0000) {
        		system_I_raw = (0 - (float) DATA);
        	}

        	// Filter result
        	measure_movAvgFilter_fast(&avgFilter_I, system_I_raw);

        	// Convert raw value to voltage
        	float DATA_LOAD_mV = (float) avgFilter_I.filterResult * ADC_I_RAW_CONVERSION;		//	3300 / 65536

        	// Convert voltage with calibration to current
			float DATA_LOAD_CALIB_mA = (ADC_I_P1 * (float) DATA_LOAD_mV) - ADC_I_CONST;
        	//PRINTF_MAIN_DEBUG("\tMUX_CFG_CH0_SINGLE_END:   %.2fmV   ...   %X   ...   %.2fmA\r\n", DATA_LOAD_mV, SGN_DATA, DATA_LOAD_CALIB_mA);

			// Store result and basic offset calib
        	if(isCurrentOffsetCalibrating == 0){
        		// If system is not calibrating subtract calibrated offset
        		statusBMS.current = DATA_LOAD_CALIB_mA - (float)setupBMS.MeasCalib_Offset_I;
        	}
        	else{
        		// If system is calibrating do not use subtract but calculate calibrated offset
        		statusBMS.current = DATA_LOAD_CALIB_mA;
        		setupBMS.MeasCalib_Offset_I = (int16_t)(statusBMS.current - SYSTEM_DEFAULT_CURRENT_mA);
        		// Write debug message during calibration
        		PRINTF_MAIN_DEBUG("\tUpdate MeasCalib_Offset_I to %4dmA, with current %4.2fmA\r\n", setupBMS.MeasCalib_Offset_I, statusBMS.current);
        	}

			// Use current to calculate charge for SoC and SoH
			update_batteryState_currentMeasured();

        	// Trigger ADC Conversion on channel 1 load voltage
    		SPI_WRT(_MUX_, MUX_CFG_CH1_SINGLE_END);
    		activeChannelExternalADC = ACTIVE_EXT_ADC_CH1_LOAD_VOLTAGE;

    		// Return that sensor 1 - current was read
			return 1;
    	} else if (activeChannelExternalADC == ACTIVE_EXT_ADC_CH1_LOAD_VOLTAGE) {
    		int32_t system_V_raw = DATA;

    		// Filter result
			measure_movAvgFilter_fast(&avgFilter_V, system_V_raw);

			// Convert raw value to voltage
    		float DATA_LOAD_mV = (float) system_V_raw * ADC_V_RAW_CONVERSION;		// ((18,2k + 1,2k) / 1,2k) 			//	(3300 / 65536)

    		// Convert raw voltage with calibration to current
    		float DATA_LOAD_CALIB_mV = (ADC_V_EXT_P1 * (float) DATA_LOAD_mV) + ADC_V_EXT_CONST;
    		//PRINTF_MAIN_DEBUG("\tMUX_CFG_CH1_SINGLE_END:   %X   ...   %X   ...   %.2fmV\r\n", DATA, SGN_DATA, DATA_LOAD_CALIB_mV);

    		// Store result
    		statusBMS.extLoadVoltage = DATA_LOAD_CALIB_mV/1000.0;

    		// Write debug message for voltage during calibration
        	if(isCurrentOffsetCalibrating == 1){
        		PRINTF_MAIN_DEBUG("\tExternal Voltage is %4.2fV\r\n", statusBMS.extLoadVoltage);
        	}

        	// Calculate voltage change rate if possible
        	calc_voltageChangeRate(statusBMS.extLoadVoltage, ADC_V_MIN_PLAUSIBLE);

        	// Wait for analog frontend to trigger current measurement
        	if(waitForCurrentMeasTrigger == 1)
        		activeChannelExternalADC = ACTIVE_EXT_ADC_WAIT_FOR_CURRENT_TRIGGER;
        	else{
        		// Trigger ADC Conversion on channel 0 current
        		SPI_WRT(_MUX_, MUX_CFG_CH0_SINGLE_END);
        		activeChannelExternalADC = ACTIVE_EXT_ADC_CH0_CURRENT;
        		//PRINTF_MAIN_DEBUG("\tCurrent measurement triggered direct\r\n");
        	}

    		// Return that sensor 2 - current was read
			return 2;
    	}
    }

    // If an error during init occurred set last successful read timestamp to 0 in order to make error permanent
    if(initExtADCError == 1){    	adcExtLastReadSuccessTimestamp = 0;
    }

    // Return that measurement was not ready
    return 0;
}

//****************************************************************************
// manage_internal_ADC - Read and trigger measurement of internal adc for both channels
//****************************************************************************
void manage_internal_ADC(){
	// Check if measurements of both channels are finished
	uint32_t chanMask = 0b00000011;
	uint32_t chanResultUpdated = Cy_SAR_GetChanResultUpdated(SAR_HW);
	if (chanMask == (chanResultUpdated & chanMask))
	{
		// Check internal ADC for coding
		uint32_t adc_coding_res = Cy_SAR_GetResult32(SAR_HW, 0UL);
		adc_coding_res_mV = Cy_SAR_CountsTo_mVolts(SAR_HW, 0UL, adc_coding_res);

		// Check internal ADC for safety switch current
		adc_safety_switch_current = Cy_SAR_GetResult32(SAR_HW, 1UL);
		adc_safety_switch_current_mV = Cy_SAR_CountsTo_mVolts(SAR_HW, 1UL, adc_safety_switch_current);

		// Trigger next internal ADC conversion
		Cy_SAR_StartConvert(SAR_HW, CY_SAR_START_CONVERT_SINGLE_SHOT);
	}
}

//****************************************************************************
// manageCommunicationBMS - Check timer overflow and cycle time
//****************************************************************************
void manage_externalCommunicationBMS(){
	static canDataSendStates canDataSendState;
	uint8_t targetData[CAN_MAX_DATA_LENGTH];

	/// DEBUG UART: CYCLIC STATUS SENDING
	// Debug status messages
	if(TIMER_COUNTER_1MS > (lastExternalCommunicationTimestamp + EXTERNAL_COMMUNICATION_TIME)){
		// Store current time as last execution time
		lastExternalCommunicationTimestamp = TIMER_COUNTER_1MS;

		//float safety_switch_current_mA = polyEvalLinear((float)adc_safety_switch_current_mV);

		PRINTF_CYCLIC_DEBUG_MSGS("V %5.2f, I %4.0fmA, VExt %5.2f, VImb %4d, BAL_MAP %4d, TH %5d, C %.1fmAh, C_SoH_i %.0fmAh, T_RR %9.3fmin, T_RT %5lums, T_E %3.1f %3.1f %3.1f, T_C %3.1f, T_I %3.1f, RTL %4u, CAN_ERR %3d, ",
				statusBMS.voltage,
				statusBMS.current,
				statusBMS.extLoadVoltage,
				statusBMS.imbalance,
				statusBMS.bal_cell_map,
				setupBMS.BalVolt,
				//adc_safety_switch_current_mV,
				//safety_switch_current_mA,
				(batteryState.capacity_init - batteryState.capacity_t)/3.6,
				batteryState.init_capacity_SoH_at_thres/3.6,
				((double)batteryState.remaining_runtime_ms)/1000.0/60.0,
				memoryRtDataRefreshTime,
				//tle9012_nodes[0].temperatures[0], // Cell temp 1
				tle9012_nodes[0].temperatures[1],
				tle9012_nodes[0].temperatures[2],
				//tle9012_nodes[0].temperatures[3], // Cell temp 2
				tle9012_nodes[0].temperatures[4],
				statusBMS.avgTemp,
				tle9012_nodes[0].temperaturesInternal[0],
				nextMemoryRtLineAddressOffset/MEM_SIZE_RT_DATA,
				canSendErrorCount
		);

		//PRINTF_MEMORY_RT_DATA_UPDATE_RATE("\tRemaining runtime   (%.2fh %.2fmin %.2fms) = %.2fAs/%.2fA*1000 (rem cap = %.2fAs)\r\n", (float)batteryState.remaining_runtime_ms/1000.0/60.0/60.0, (float)batteryState.remaining_runtime_ms/1000.0/60.0, (float)batteryState.remaining_runtime_ms, batteryState.capacity_usable_remaining, (statusBMS.current)/1000.0, (batteryState.capacity_init - batteryState.capacity_t));
		//PRINTF_MEMORY_RT_DATA_UPDATE_RATE("\tRefresh rate %ld ms (dynamic %.0lfms/%ldlines remaining)\r\n", memoryRtDataRefreshTime, (float)batteryState.remaining_runtime_ms, (uint32_t)((MEM_ADDR_RT_DATA_STOP-MEM_ADDR_RT_DATA_START)/MEM_SIZE_RT_DATA)-(nextMemoryRtLineAddressOffset/MEM_SIZE_RT_DATA));


		//// Print error bitmap
		//PRINTF_CYCLIC_DEBUG_MSGS("ERR ");
		//printBinary(statusBMS.error_map, UINT32_MAX, 32);
		//PRINTF_CYCLIC_DEBUG_MSGS(", ");

		// State of connection / slot
		if(statusBMS.slotState == SLOT_NONE)
			PRINTF_CYCLIC_DEBUG_MSGS("SLOT_NONE       , ");
		else if(statusBMS.slotState == SLOT_IN_CHARGER)
			PRINTF_CYCLIC_DEBUG_MSGS("SLOT_CHARGER , ");
		else if(statusBMS.slotState == SLOT_IN_SYSTEM_1)
			PRINTF_CYCLIC_DEBUG_MSGS("SLOT_SYSTEM1 , ");
		else if(statusBMS.slotState == SLOT_IN_SYSTEM_2)
			PRINTF_CYCLIC_DEBUG_MSGS("SLOT_SYSTEM2 , ");

		// State of BMS
		if(statusBMS.bms_state == BMS_CHARGING)
			PRINTF_CYCLIC_DEBUG_MSGS("CHARGING   , ");
		else if(statusBMS.bms_state == BMS_DISCHARGING)
			PRINTF_CYCLIC_DEBUG_MSGS("DISCHARGING, ");
		else if(statusBMS.bms_state == BMS_ERROR)
			PRINTF_CYCLIC_DEBUG_MSGS("BMS_ERROR      , ");
		else if(statusBMS.bms_state == BMS_IDLE)
			PRINTF_CYCLIC_DEBUG_MSGS("BMS_IDLE       , ");
		else
			PRINTF_CYCLIC_DEBUG_MSGS("BMS STATE %d   , ", statusBMS.bms_state);

		// State of BMS
		if(statusBMS.hotSwapRole == HOTSWAP_MAIN)
			PRINTF_CYCLIC_DEBUG_MSGS("ROLE_MAIN  , ");
		else if(statusBMS.hotSwapRole == HOTSWAP_GIVER)
			PRINTF_CYCLIC_DEBUG_MSGS("ROLE_GIVER , ");
		else if(statusBMS.hotSwapRole == HOTSWAP_TAKER)
			PRINTF_CYCLIC_DEBUG_MSGS("ROLE_TAKER , ");
		else if(statusBMS.hotSwapRole == HOTSWAP_ERROR)
			PRINTF_CYCLIC_DEBUG_MSGS("ROLE_ERROR , ");
		else
			PRINTF_CYCLIC_DEBUG_MSGS("ROLE %d    , ", statusBMS.hotSwapRole);

