Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
		// Print coding resistor readings
		//PRINTF_CYCLIC_DEBUG_MSGS("R_COD %ldmV\r\n", adc_coding_res_mV);

		// Print cell specific errors
		if(latched_error_map_ext_com & ERR_CAF_OL_ERR){
			PRINTF_CYCLIC_DEBUG_MSGS("OL_MAP ");
			printBinary((uint32_t)statusBMS.ol_map, 0b0000111111111111, 16);
			PRINTF_CYCLIC_DEBUG_MSGS(", ");
		}
		if(latched_error_map_ext_com & ERR_CAF_CELL_UV){
			PRINTF_CYCLIC_DEBUG_MSGS("UV_MAP ");
			printBinary((uint32_t)statusBMS.uv_map, 0b0000111111111111, 16);
			PRINTF_CYCLIC_DEBUG_MSGS(", ");
		}
		if(latched_error_map_ext_com & ERR_CAF_CELL_OV){
			PRINTF_CYCLIC_DEBUG_MSGS("OV_MAP ");
			printBinary((uint32_t)statusBMS.ov_map, 0b0000111111111111, 16);
			PRINTF_CYCLIC_DEBUG_MSGS(", ");
		}
		if(latched_error_map_ext_com & ERR_CAF_BAL_UC){
			PRINTF_CYCLIC_DEBUG_MSGS("UC_MAP ");
			printBinary((uint32_t)statusBMS.bal_uc_map, 0b0000111111111111, 16);
			PRINTF_CYCLIC_DEBUG_MSGS(", ");
		}
		if(latched_error_map_ext_com & ERR_CAF_BAL_OC){
			PRINTF_CYCLIC_DEBUG_MSGS("OC_MAP ");
			printBinary((uint32_t)statusBMS.bal_oc_map, 0b0000111111111111, 16);
			PRINTF_CYCLIC_DEBUG_MSGS(", ");
		}

		// Print bitmaps
		//PRINTF_CYCLIC_DEBUG_MSGS(", BMS_ERROR 0b"); printBinary(latched_error_map_ext_com, UINT32_MAX, 32);
		diagnostic_printStatusFlags(latched_error_map_ext_com, latched_message_map, 0, 0);

		PRINTF_CYCLIC_DEBUG_MSGS("\r\n");

		// Reset latched bitmaps
		reset_latchedBitmaps(0, 1);


		//// CAN
		// Print received package data
		if(newCanMessageReceived != 0){
			//PRINTF_CYCLIC_DEBUG_MSGS("New CAN Message\r\n");
			// Count receive of specific message
			if(receivedCanHandshakeCount != 0){
				PRINTF_CYCLIC_DEBUG_MSGS("HANDSHAKE Count %3d\r\n", receivedCanHandshakeCount);
			}
			if(receivedCanSwapCount != 0){
				PRINTF_CYCLIC_DEBUG_MSGS("SWAP Count      %3d\r\n", receivedCanSwapCount);
			}
			if(receivedCanFinishCount != 0){
				PRINTF_CYCLIC_DEBUG_MSGS("FINISH Count      %3d\r\n", receivedCanFinishCount);
			}
			//PRINTF_CYCLIC_DEBUG_MSGS("\r\n");

			// Reset CAN
			newCanMessageReceived = 0;
			receivedCanHandshakeCount = 0;
			receivedCanSwapCount = 0;
			receivedCanFinishCount = 0;
		}
	}

	/// DEBUG UART: RECEIVED MESSAGE CHECK
	// Prepare buffer
	#define RX_BUFFER_UART_SIZE 100
	uint8_t rxBufferUART[RX_BUFFER_UART_SIZE];
	//uint16_t cmdLen = 0;
	static uint16_t full_rx_size = 0;
	size_t rx_size = RX_BUFFER_UART_SIZE;

	// Read buffer and store received data
	cyhal_uart_read(&cy_retarget_io_uart_obj, &rxBufferUART[full_rx_size], &rx_size);
	full_rx_size += rx_size;

	// If \r was received store command and print result
	if (rxBufferUART[full_rx_size - 1] == 0x0d) {
		printf("Received %d bytes from UART: ", full_rx_size);
		for(uint8_t i=0; i<full_rx_size-1; i++){
			printf(" %d (%c)", rxBufferUART[i], rxBufferUART[i]);
		}
		printf(" %d", rxBufferUART[full_rx_size-1]);
		printf("\r\n");
		full_rx_size = 0;
		//cyhal_uart_clear(&cy_retarget_io_uart_obj);
	}

	/// CAN COMMUNICATION
	// Send information about BMS state via CAN. Only from active BMS
	if(statusBMS.hotSwapRole == HOTSWAP_MAIN && (TIMER_COUNTER_1MS > (canLastMessageTimestamp + CAN_MINIMAL_MESSAGE_TIME + (rand() % 4)))){
		// Store current time as last message send time
		canLastMessageTimestamp = TIMER_COUNTER_1MS;

		// There are 3 types of messages (switchOnVeto for HotSwap, CAN requests and repeated status message sending) which are handled with given priority.
		cy_en_canfd_status_t can_status = UINT8_MAX;
		if(TIMER_COUNTER_1MS > (canSwitchOnVetoRefreshTimestamp + CAN_SWICH_ON_VETO_REFRESH_TIME)){
			// Store current time as last execution time
			canSwitchOnVetoRefreshTimestamp = TIMER_COUNTER_1MS;

			// Send switch on veto with data 200 to signal other BMS that this one is active
			targetData[0] = 200;
			targetData[1] = 1;
			//can_status = CAN_TX_Request((ROBOT_CONTROL_CLASS_MASK | 0x00), BMS_SwitchOn_Veto, targetData, 2);
			if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
				can_status = CAN_TX_Request(BMS_CLASS_MASK+1, BMS_SwitchOn_Veto, targetData, 2);
			}
			else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
				can_status = CAN_TX_Request(BMS_CLASS_MASK  , BMS_SwitchOn_Veto, targetData, 2);
			}
		}
		else if((isCanRequested_RT_Reset |
				 isCanRequested_RT_GetLine |
				 isCanRequested_RT_GetStoredLineNumber |
				 isCanRequested_RT_GetMaxLineNumber |
				 isCanRequested_RT_SetSamplingTime |
				 isCanRequested_RT_GetSamplingTime) != 0){
			if(isCanRequested_RT_Reset >= 1){
				// Reset line index of RT data recording
				memoryResetRtData();
				isCanRequested_RT_Reset = 0;
				PRINTF_MAIN_RT_CAN_REQUEST("\t CAN RT data line reset requested\r\n");
			}
			else if(isCanRequested_RT_GetLine == 1){
				// At the beginning of a line read the hole line to buffer, to be transfered in parts
				if(CanRequested_LinesCurrentIndexPart == 0){
					// Get data line as byte array
					memoryGetRtData_byteArray(memoryRtDataLineBuffer, 1, CanRequested_LinesStartIndex+CanRequested_LinesCurrentIndex);
					//memoryGetRtData(NULL, 1, CanRequested_LinesStartIndex+CanRequested_LinesCurrentIndex, 1);
					PRINTF_MAIN_RT_CAN_REQUEST("CAN RT data get lines requested, sending: start %u, stop %u, current %3u \r\n", CanRequested_LinesStartIndex, CanRequested_LinesNumber, CanRequested_LinesCurrentIndex);
					PRINTF_MAIN_RT_GETLINE_DEBUG("\tRead line %d to buffer %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X \r\n", CanRequested_LinesStartIndex, memoryRtDataLineBuffer[0], memoryRtDataLineBuffer[1], memoryRtDataLineBuffer[2], memoryRtDataLineBuffer[3], memoryRtDataLineBuffer[4], memoryRtDataLineBuffer[5], memoryRtDataLineBuffer[6], memoryRtDataLineBuffer[7], memoryRtDataLineBuffer[8], memoryRtDataLineBuffer[9]);
				}

				// Determine length to be transmitted (the last part of the current line may not fill a whole CAN message)
				uint8_t dataLength = CAN_MAX_DATA_LENGTH;
				if((CanRequested_LinesCurrentIndexPart+1)*CAN_MAX_DATA_LENGTH > MEM_SIZE_RT_DATA){
					dataLength = MEM_SIZE_RT_DATA - CanRequested_LinesCurrentIndexPart*CAN_MAX_DATA_LENGTH;  // MEM_SIZE_RT_DATA-(CAN_MAX_DATA_LENGTH*CanRequested_LinesCurrentIndexPart);
				}
				PRINTF_MAIN_RT_GETLINE_DEBUG("\tSending message from buffer index %u with length %u \r\n", (CanRequested_LinesCurrentIndexPart*CAN_MAX_DATA_LENGTH), dataLength);

