Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
				// Send line part via CAN
				can_status = CAN_TX_Request((ROBOT_CONTROL_CLASS_MASK | 0x00), BMS_RT_Data_SendLinePart, &memoryRtDataLineBuffer[(CanRequested_LinesCurrentIndexPart*CAN_MAX_DATA_LENGTH)], dataLength);
				if(can_status == CY_CANFD_SUCCESS){
					CanRequested_LinesCurrentIndexPart++;
				}

				// Check if line is finished and next line must be send
				if(CanRequested_LinesCurrentIndexPart > MEM_SIZE_RT_DATA/CAN_MAX_DATA_LENGTH){
					CanRequested_LinesCurrentIndex++;
					CanRequested_LinesCurrentIndexPart = 0;
					PRINTF_MAIN_RT_GETLINE_DEBUG("\tProcessing next line %d \r\n", CanRequested_LinesCurrentIndex);

					// If the current line index is higher than max request is finished
					if(CanRequested_LinesCurrentIndex > MEM_SIZE_MAX_LINES){
						isCanRequested_RT_GetLine = 0;
						PRINTF_MAIN_RT_GETLINE_DEBUG("\tProcessed last possible line. GetLine CAN request stopped \r\n");
					}

					// If the current line index is after stop index the request is finished
					if(CanRequested_LinesCurrentIndex > CanRequested_LinesNumber-1){
						isCanRequested_RT_GetLine = 0;
						PRINTF_MAIN_RT_GETLINE_DEBUG("\tProcessed last requested line. GetLine CAN request finished \r\n");
					}
				}
			}
			else if(isCanRequested_RT_GetStoredLineNumber >= 1){
				uint16_t storedLineNumber = nextMemoryRtLineAddressOffset/MEM_SIZE_RT_DATA;
				targetData[0] = ((storedLineNumber) & 0xFF);
				targetData[1] = ((storedLineNumber) >> 8 & 0xFF);
				// Try to send number via CAN for max 5 times before ignoring the request
				can_status = CAN_TX_Request((ROBOT_CONTROL_CLASS_MASK | 0x00), BMS_RT_Data_GetStoredLineNumber, targetData, 2);
				if(can_status == CY_CANFD_SUCCESS)
					isCanRequested_RT_GetStoredLineNumber = 0;
				else
					isCanRequested_RT_GetStoredLineNumber++;
				if(isCanRequested_RT_GetStoredLineNumber > 5)
					isCanRequested_RT_GetStoredLineNumber = 0;
				PRINTF_MAIN_RT_CAN_REQUEST("\t CAN RT data get stored line number requested\r\n");
			}
			else if(isCanRequested_RT_GetMaxLineNumber >= 1){
				uint16_t maxLineNumber = MEM_SIZE_MAX_LINES;
				targetData[0] = ((maxLineNumber) & 0xFF);
				targetData[1] = ((maxLineNumber) >> 8 & 0xFF);
				// Try to send number via CAN for max 5 times before ignoring the request
				can_status = CAN_TX_Request((ROBOT_CONTROL_CLASS_MASK | 0x00), BMS_RT_Data_GetMaxLineNumber, targetData, 2);
				if(can_status == CY_CANFD_SUCCESS)
					isCanRequested_RT_GetMaxLineNumber = 0;
				else
					isCanRequested_RT_GetMaxLineNumber++;
				if(isCanRequested_RT_GetMaxLineNumber > 5)
					isCanRequested_RT_GetMaxLineNumber = 0;
				PRINTF_MAIN_RT_CAN_REQUEST("\t CAN RT data get max line number requested\r\n");
			}
			else if(isCanRequested_RT_SetSamplingTime >= 1){
				// Limit check and value setting
				if(CanRequested_SamplingTime == 0){
					memoryRtDataRefresh_isTimeFixed = 0;
					memoryRtDataRefreshTime = 0;
					PRINTF_MAIN_RT_CAN_REQUEST("CAN RT data set sampling time: Enabled dynamic sampling time");
				}else{
					memoryRtDataRefresh_isTimeFixed = 1;
					memoryRtDataRefreshTime = CanRequested_SamplingTime;
					PRINTF_MAIN_RT_CAN_REQUEST("CAN RT data set sampling time: Enabled fixed sampling time of %lu", memoryRtDataRefreshTime);
				}
				isCanRequested_RT_SetSamplingTime = 0;
			}
			else if(isCanRequested_RT_GetSamplingTime >= 1){
				uint32_t samplingTime = memoryRtDataRefreshTime;
				targetData[0] = ((samplingTime) & 0xFF);
				targetData[1] = ((samplingTime) >> 8 & 0xFF);
				targetData[2] = ((samplingTime) >> 16 & 0xFF);
				targetData[3] = ((samplingTime) >> 24 & 0xFF);
				// Try to send number via CAN for max 5 times before ignoring the request
				can_status = CAN_TX_Request((ROBOT_CONTROL_CLASS_MASK | 0x00), BMS_RT_Data_GetSamplingTime, targetData, 4);
				if(can_status == CY_CANFD_SUCCESS)
					isCanRequested_RT_GetSamplingTime = 0;
				else
					isCanRequested_RT_GetSamplingTime++;
				if(isCanRequested_RT_GetSamplingTime > 5)
					isCanRequested_RT_GetSamplingTime = 0;
				PRINTF_MAIN_RT_CAN_REQUEST("\t CAN RT data get sampling time\r\n");
			}
		}
		else if(TIMER_COUNTER_1MS > (canDataRefreshTimestamp + CAN_DATA_REFRESH_TIME)){
			// Store current time as last execution time
			canDataRefreshTimestamp = TIMER_COUNTER_1MS;

			// Send current data and increment data index
			switch (canDataSendState) {
				case CAN_DATA_SEND_SOC:
					targetData[0] = (uint8_t)(statusBMS.SoC);
					targetData[1] = 0;
					//can_status = CAN_TX_Request((ROBOT_CONTROL_CLASS_MASK | 0x00), BMS_Data_SOC, targetData, 2);
					can_status = CAN_TX_Request(BMS_Data_SOC, BMS_Data_SOC, targetData, 2);
					if(can_status == CY_CANFD_SUCCESS)
						canDataSendState = CAN_DATA_SEND_VOLTAGE;
					break;
				case CAN_DATA_SEND_VOLTAGE:
					targetData[0] = (((uint16_t)(statusBMS.voltage*1000.0)) & 0xFF);
					targetData[1] = (((uint16_t)(statusBMS.voltage*1000.0)) >> 8 & 0xFF);
					//can_status = CAN_TX_Request((ROBOT_CONTROL_CLASS_MASK | 0x00), BMS_Data_Voltage, targetData, 2);
					can_status = CAN_TX_Request(BMS_Data_Voltage, BMS_Data_Voltage, targetData, 2);
					if(can_status == CY_CANFD_SUCCESS)
						canDataSendState = CAN_DATA_SEND_CURRENT;
					break;
				case CAN_DATA_SEND_CURRENT:
					targetData[0] = (((int16_t)statusBMS.current) & 0xFF);
					targetData[1] = (((int16_t)statusBMS.current) >> 8 & 0xFF);
					//can_status = CAN_TX_Request((ROBOT_CONTROL_CLASS_MASK | 0x00), BMS_Data_Current, targetData, 2);
					can_status = CAN_TX_Request(BMS_Data_Current, BMS_Data_Current, targetData, 2);
					if(can_status == CY_CANFD_SUCCESS)
						canDataSendState = CAN_DATA_SEND_SOC;
					break;
				default:
					break;
			}

		}

		// Turn on blue led if communication successful or off if failed
		if(can_status != UINT8_MAX){
			if(canSendSuccessCount > 2)
				cyhal_gpio_write(BMS_LED4_BL, 1);
			else{
				cyhal_gpio_write(BMS_LED4_BL, 0);
				//CAN_Reset();
			}
		}

