Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
		// Write debug message if CAN message send fails
		//if(can_status != CY_CANFD_SUCCESS){
		//	PRINTF_MAIN_DEBUG("CAN send failed %d\r\n", can_status);
		//}
	}
}

//****************************************************************************
// manage_timer - Check timer overflow and cycle time
//****************************************************************************
void manage_timer(){
	// Reset timer and all time storing variables before a overflow occurs
	if(Cy_TCPWM_Counter_GetCounter(TIMER_1MS_HW, TIMER_1MS_NUM) > TIMER_1MS_config.period-5000){
		// Reset counter
		Cy_TCPWM_TriggerStopOrKill_Single(TIMER_1MS_HW, TIMER_1MS_NUM);
		Cy_TCPWM_Counter_Disable(TIMER_1MS_HW, TIMER_1MS_NUM);
		Cy_TCPWM_Counter_SetCounter(TIMER_1MS_HW, TIMER_1MS_NUM, 0);
		Cy_TCPWM_Counter_Enable(TIMER_1MS_HW, TIMER_1MS_NUM);
		Cy_TCPWM_TriggerStart_Single(TIMER_1MS_HW, TIMER_1MS_NUM);

		// Reset all time storages //TODO low priority, does only happen after days of continuous run

	}
}

//****************************************************************************
// manage_slotState - Check the coding ADC channel and determine what state system is in
//****************************************************************************
void manage_slotState(uint8_t ignoreDebounce){
	// Decide in which slot state the system is
	if(adc_coding_res_mV > CODING_RES_MAINBOARD_2_BELOW_mV){
		// Write debug message and determine CAN ID only on initial slot change back to none
		if(statusBMS.slotState != SLOT_NONE){
			PRINTF_MAIN_DEBUG("BMS is not in base: %ldmV\r\n", adc_coding_res_mV);

			// Refresh own CAN ID
			set_canfd_ID_based_on_slot();
		}
		// Change State
		statusBMS.slotState = SLOT_NONE;

		// Store time of last state change
		slotPlugDebounceTimestamp = TIMER_COUNTER_1MS;
	}
	// If time since last SLOT_NONE detection is greater than SLOT_PLUG_DEBOUNCE_TIME check in which slot the system is now
	else if((ignoreDebounce == 1) || (TIMER_COUNTER_1MS > (slotPlugDebounceTimestamp + SLOT_PLUG_DEBOUNCE_TIME))){
		// Determine slot based on current and coding resistor or only based on coding resistor (see DETECT_SLOT_BASED_ON_CURRENT)
		// EXPERIMENTAL: Detect CHARGER if current is below zero
		#if DETECT_SLOT_BASED_ON_CURRENT == 1
			if(statusBMS.current < 0){
				if(statusBMS.slotState != SLOT_IN_CHARGER){
					PRINTF_MAIN_DEBUG("BMS is in charger: %ldmV\r\n", adc_coding_res_mV);

					// Change State
					statusBMS.slotState = SLOT_IN_CHARGER;

					// Refresh own CAN ID
					set_canfd_ID_based_on_slot();
				}
			}
			else if(adc_coding_res_mV > CODING_RES_CHARGER_BELOW_mV && adc_coding_res_mV < CODING_RES_MAINBOARD_1_BELOW_mV && statusBMS.slotState != SLOT_IN_SYSTEM_1){
				PRINTF_MAIN_DEBUG("BMS is in IMR mainboard 1: %ldmV\r\n", adc_coding_res_mV);

				// Change State
				statusBMS.slotState = SLOT_IN_SYSTEM_1;

				// Refresh own CAN ID
				set_canfd_ID_based_on_slot();
			}
			else if(adc_coding_res_mV > CODING_RES_MAINBOARD_1_BELOW_mV && adc_coding_res_mV < CODING_RES_MAINBOARD_2_BELOW_mV && statusBMS.slotState != SLOT_IN_SYSTEM_2){
				PRINTF_MAIN_DEBUG("BMS is in IMR mainboard 2: %ldmV\r\n", adc_coding_res_mV);

				// Change State
				statusBMS.slotState = SLOT_IN_SYSTEM_2;

				// Refresh own CAN ID
				set_canfd_ID_based_on_slot();
			}
		// DEFAULT: Detect all slot state only based on coding resistor
		#else
			if(adc_coding_res_mV > CODING_RES_CHARGER_BELOW_mV && adc_coding_res_mV < CODING_RES_MAINBOARD_1_BELOW_mV && statusBMS.slotState != SLOT_IN_SYSTEM_1){
				PRINTF_MAIN_DEBUG("BMS is in IMR mainboard 1: %ldmV\r\n", adc_coding_res_mV);

				// Change State
				statusBMS.slotState = SLOT_IN_SYSTEM_1;

				// Refresh own CAN ID
				set_canfd_ID_based_on_slot();
			}
			else if(adc_coding_res_mV > CODING_RES_MAINBOARD_1_BELOW_mV && adc_coding_res_mV < CODING_RES_MAINBOARD_2_BELOW_mV && statusBMS.slotState != SLOT_IN_SYSTEM_2){
				PRINTF_MAIN_DEBUG("BMS is in IMR mainboard 2: %ldmV\r\n", adc_coding_res_mV);

				// Change State
				statusBMS.slotState = SLOT_IN_SYSTEM_2;

				// Refresh own CAN ID
				set_canfd_ID_based_on_slot();
			}
			else if(adc_coding_res_mV < CODING_RES_CHARGER_BELOW_mV && statusBMS.slotState != SLOT_IN_CHARGER){
				PRINTF_MAIN_DEBUG("BMS is in charger: %ldmV\r\n", adc_coding_res_mV);

				// Change State
				statusBMS.slotState = SLOT_IN_CHARGER;

				// Refresh own CAN ID
				set_canfd_ID_based_on_slot();
			}
		#endif
	}
}


//****************************************************************************
// manage_shutdown - Check if shutdown button is pressed and kill system by disabling shutdown pin
//****************************************************************************
void manage_shutdown(){
	// Check how long deep discharge threshold is exceeded
	uint8_t isDeepDischargeProtectionTriggered = 0;
	if(statusBMS.voltage > (float)DEEP_DISCHARGE_PROTECTION_V){
		deepDischargeTimestamp = TIMER_COUNTER_1MS;
	}
	else if(TIMER_COUNTER_1MS > (deepDischargeTimestamp + DEEP_DISCHARGE_PROTECTION_TIME)){
		isDeepDischargeProtectionTriggered = 1;
	}

	// If shutdown button is pressed or deep discharge protection is activated...
	if((isShutdownTriggered == 0) && (cyhal_gpio_read(BUTTON_SHUTDOWN) == 1 || isDeepDischargeProtectionTriggered == 1)){
		PRINTF_MAIN_DEBUG("Shutdown triggered - Button %d, System voltage = %.2f (deep discharge protection below %.2f)\r\n", cyhal_gpio_read(BUTTON_SHUTDOWN), statusBMS.voltage, (float)DEEP_DISCHARGE_PROTECTION_V);
		// Mark time when shutdown was triggered and activate software watchdog if it is not already running (will shut down hard if shutdown takes longer than MAXIMUM_SHUTDOWN_TIME)
		shutdownTriggeredTimestamp = TIMER_COUNTER_1MS;
		isWatchdogActive = 1;
		// If system is in a system slot, mark that shutdown is triggered. In this state the HOTSWAP will be initialized and lead to shutdown after give-over or error shutdown
		if((statusBMS.slotState == SLOT_IN_SYSTEM_1 || statusBMS.slotState == SLOT_IN_SYSTEM_2) && (statusBMS.bms_state == BMS_CHARGING || statusBMS.bms_state == BMS_DISCHARGING)){
			isShutdownTriggered = 1;
		}
		// In any other state shut down directly
		else{
			PRINTF_MAIN_DEBUG("System is not in a 'wait for shutdown' condition. Direct shutdown:\r\n");
			shutdownSystem();
		}
	}

	// Note: Hard shutdown after MAXIMUM_SHUTDOWN_TIME is performed in software watchdog timer_watchdog_interrupt_handler()
}

//****************************************************************************
// keepHardwareWatchdogAlive - Send a kick to the hardware watchdog. This must be called faster than every HARDWARE_WATCHDOG_TIMEOUT ms
//****************************************************************************
void keepHardwareWatchdogAlive(){
	// Keep hardware watchdog alive
	#if ENABLE_HARDWARE_WATCHDOG == 1
		cyhal_wdt_kick(&wdt_obj);
	#endif /* #if defined (ENABLE_HARDWARE_WATCHDOG) */

