Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
}

//****************************************************************************
// shutdownSystem - Deactivate Watchdog and shutdown system by disabling shutdown pin
//****************************************************************************
void shutdownSystem(){
	PRINTF_MAIN_DEBUG("SHUTDOWN SYSTEM!\r\n");

	// Disable safety switch
	setSwitchIsolating();
	cyhal_gpio_write(BMS_LED2_OR, 0);

	// Set output state to OFF so it will be shown on the display
	statusBMS.outputState = OUTPUT_OFF;

	// Deactivate software watchdog to prevent it from triggering
	isWatchdogActive = 0;

	// Init time stamp for Green LED blinking
	uint32_t shutdownBlinkTimestamp = TIMER_COUNTER_1MS;

	// Keep hardware watchdog alive one last time. If system does not shut down HARDWARE_WATCHDOG_TIMEOUT ms after this the watchdog will reset the system
	keepHardwareWatchdogAlive();

	// Make display refresh for the last time and disable shutdown pin
	for(uint16_t i = 0; i < LAST_UPDATE_DISPLAY_NUM; i++){
		// Blink green LED
		if(TIMER_COUNTER_1MS > (shutdownBlinkTimestamp + BLINK_TIME_LED_GREEN_SHUTDOWN)){
			cyhal_gpio_toggle(BMS_LED1_GR);
			shutdownBlinkTimestamp = TIMER_COUNTER_1MS;
		}
		// Update display and send shutdown command so it will refresh to main page and stop refreshing.
		updatePublicDisplayData(PUBLIC_COMMAND_SHUTDOWN);

		// When the last update is done the CM0+ core will return the done command
		if(sh_pub_command == PUBLIC_COMMAND_DONE){
			// Send debug message and shut down system
			PRINTF_MAIN_DEBUG("Display finished update, shut down now\r\n");
			cyhal_system_delay_ms(10);
			cyhal_gpio_write(VCC_HOLD, 0);
			// End loop
			break;
		}

		// Limit the time between executions
		cyhal_system_delay_ms(LAST_UPDATE_DISPLAY_DELAY);
	}

	// Debug message if display refresh was not successful
	if(sh_pub_command != PUBLIC_COMMAND_DONE){
		PRINTF_MAIN_DEBUG("Display did not finish update %d\r\n", sh_pub_command);
		cyhal_system_delay_ms(10);
	}

	// Shut down system even if all else fails and wait till system is off
	while(1){
		cyhal_gpio_write(VCC_HOLD, 0);
		cyhal_system_delay_ms(BLINK_TIME_LED_GREEN_SHUTDOWN);
		cyhal_gpio_toggle(BMS_LED1_GR);
		PRINTF_MAIN_DEBUG("Disabled VCC_HOLD\r\n");

		// NOTE: If following line is inactive the system will stay in in shutdown if the power on button is held continuously
		//       If it is enabled the system will reboot and potentially start up/ switch ON again
		//NVIC_SystemReset();
	}
}

//****************************************************************************
// reset_safetySwitchTurnOn - Reset switch-on counter and reset state to make switch on possible again
//****************************************************************************
void reset_safetySwitchTurnOn(){
	PRINTF_MAIN_DEBUG("Safety switch reset triggered\r\n");
	// Reset number turn of tries
	safety_switch_retry_counter = 0;
	// Reset number of common errors
	numComErrors_TLE9012 = 0;
	// Reset can message counter so that system is in known state (especially switch on veto counter would trigger ERR_INT_SWITCH_ON_VETO_RECEIVED if not reset)
	resetCanMessageCounters();
	// Reset the direct save state set on error interrupt
	SafetySwitchInterrupt_SaveStateSet = DIRECT_SAVESTATE_ON_INTERRUPT;
	AnalogFrontendInterrupt_SaveStateSet = DIRECT_SAVESTATE_ON_INTERRUPT;
}

//****************************************************************************
// reset_latchedBitmaps - Resets each bitmap which content needs to be accumulated until a certain event happens. Does not effect the main/actual versions of the maps
//****************************************************************************
void reset_latchedBitmaps(uint8_t reset_error_map_switch_on, uint8_t reset_error_map_ext_com){
	// Reset the map that latches errors between switch ON of the safety switch if needed
	if(reset_error_map_switch_on != 0){
		latched_error_map_switch_on = 0;
	}
	// Reset the map that latches errors between PC/CAN transmissions if needed
	if(reset_error_map_ext_com != 0){
		latched_error_map_ext_com = 0;
	}

	// Reset remaining maps
	latched_message_map = 0;
	statusBMS.ol_map = 0;
	statusBMS.uv_map = 0;
	statusBMS.ov_map = 0;
	statusBMS.bal_uc_map = 0;
	statusBMS.bal_oc_map = 0;
}

//****************************************************************************
// calc_voltageChangeRate - Calculate the load voltage change rate if conditions are right (external voltage larger than minimal and at least on good measurement done before calculation)
// Writes the current rate if switch is in precharge mode
//****************************************************************************
void calc_voltageChangeRate(float loadVoltage, float minLoadVoltage){
	// Calculate voltage change rate
	if(loadVoltage > minLoadVoltage){
		// If the last read was successful calculate the change rate
		if(lastExtVoltageMeasurement < (ADC_EXT_V_CHANGE_RATE_MAX-0.01)){ // Float equivalent of != 0
			// Calculate change rate
			statusBMS.voltageChangeRate_ms = (loadVoltage - lastExtVoltageMeasurement)/(float)(TIMER_COUNTER_1MS - adcLastVoltageChangeRateTimestamp);
			// Print change rate only during precharge
			if(statusBMS.switchState == SWITCH_PRECHARGE){
				PRINTF_MAIN_DEBUG("\tVoltage change rate %11.8fV/ms, %5.3f-%5.3f in %ldms\r\n", statusBMS.voltageChangeRate_ms, loadVoltage, lastExtVoltageMeasurement, TIMER_COUNTER_1MS - adcLastVoltageChangeRateTimestamp);
			}
		}
		// If this read is successful store time and last voltage
		lastExtVoltageMeasurement = loadVoltage;
		adcLastVoltageChangeRateTimestamp = TIMER_COUNTER_1MS;
	}
	else{
		// Set change rate variables to a implausible signal
		statusBMS.voltageChangeRate_ms = ADC_EXT_V_CHANGE_RATE_MAX;
		lastExtVoltageMeasurement = ADC_EXT_V_CHANGE_RATE_MAX;
	}
}

//****************************************************************************
// updatePublicDisplayData - Write all runtime data shown on display to public
//							 RAM area where it can be accessed by CM0+
// Returns 1 if CM0+ send a done back
//****************************************************************************
uint8_t updatePublicDisplayData(public_core_commands command){
	static uint8_t cell_V_index = 0;
	uint8_t returnRefreshDone = 0;

	// Limit data refresh time
	if((command == PUBLIC_COMMAND_SHUTDOWN) || (TIMER_COUNTER_1MS > (updatePublicDisplayDataTimestamp + UPDATE_PUBLIC_DISPLAY_DATA_TIME))){
		/// Update public variables from shadow buffer if resource is not used at the moment (non blocking)
		if (Cy_IPC_Sema_Status(SEMA_DISPLAY_VAR)        != CY_IPC_SEMA_STATUS_LOCKED){
			if(Cy_IPC_Sema_Set(  SEMA_DISPLAY_VAR, false) == CY_IPC_SEMA_SUCCESS){
				// Store time of last update
				updatePublicDisplayDataTimestamp = TIMER_COUNTER_1MS;

