Infineon/IMR_PSoC6_BMS/proj_cm4/main.c
				/// Store latest values in shadow variables
				// Error map
				sh_pub_error_map = latched_error_map_switch_on | statusBMS.error_map;

				// SoC and SoH
				sh_pub_soc = statusBMS.SoC;
				sh_pub_soh = statusBMS.SoH;

				// System voltage
				sh_pub_volt = (uint16_t)(tle9012_nodes[0].block_voltage*1000.0);

				// System current
				sh_pub_current = statusBMS.current;

				// Slot state
				sh_pub_slotState = statusBMS.slotState;

				// Output state
				sh_pub_outputState = statusBMS.outputState;

				// Cell Voltage and diagnostic (3 MSBs are cellDiagnosticStates, rest is voltage in mV)
				for(uint8_t i = 0; i < NUM_CELLS; i++){
					/// Store voltage value of cell in shadow register
					sh_pub_cells[i] = tle9012_nodes[0].cell_voltages[i];
					// If voltage is to high set it to max (this should never happen)
					if(tle9012_nodes[0].cell_voltages[i] >= CELL_DIAGNOSTIC_MAX_mV){
						sh_pub_cells[i] = CELL_DIAGNOSTIC_MAX_mV;
					}

					/// Add diagnostic state if needed
					if((statusBMS.ol_map & (1 << i)) != 0){
						sh_pub_cells[i] |= CELL_DIAG_OPEN_LOOP;
					}
					else if((statusBMS.uv_map & (1 << i)) != 0){
						sh_pub_cells[i] |= CELL_DIAG_UNDERVOLTAGE;
					}
					else if((statusBMS.ov_map & (1 << i)) != 0){
						sh_pub_cells[i] |= CELL_DIAG_OVERVOLTAGE;
					}
					else if((statusBMS.bal_uc_map & (1 << i)) != 0){
						sh_pub_cells[i] |= CELL_DIAG_BAL_UNDERVOLTAGE;
					}
					else if((statusBMS.bal_oc_map & (1 << i)) != 0){
						sh_pub_cells[i] |= CELL_DIAG_BAL_OVERVOLTAGE;
					}
					else if((statusBMS.bal_cell_map & (1 << i)) != 0){
						sh_pub_cells[i] |= CELL_DIAG_IS_BALANCING;
					}
				}


				// Update variables that are refreshed every cycle
				PUB_RAM_ACCESS(uint32_t, 	 PUB1_ERROR_MAP)   	 = sh_pub_error_map;
				PUB_RAM_ACCESS(uint8_t, 	 PUB2_SOC) 			 = sh_pub_soc;
				PUB_RAM_ACCESS(uint8_t, 	 PUB3_SOH) 			 = sh_pub_soh;
				PUB_RAM_ACCESS(uint16_t, 	 PUB4_VOLT) 		 = sh_pub_volt;
				PUB_RAM_ACCESS(int16_t, 	 PUB5_CURRENT)		 = sh_pub_current;
				PUB_RAM_ACCESS(outputStates, PUB6_OUTPUT_STATE)  = sh_pub_outputState;
				PUB_RAM_ACCESS(slotStates, 	 PUB7_SLOT_STATE)    = sh_pub_slotState;
				// Update variables that are not refreshed every cycle (every cycle the next on will be refreshed)
				PUB_RAM_ACCESS(uint16_t,	 PUB8_CELL_V)     	 = sh_pub_cells[cell_V_index];
				PUB_RAM_ACCESS(uint8_t,		 PUB8_CELL_V_IDX)	 = cell_V_index;
				//PRINTF_MAIN_DEBUG("Write C %d = %d\r\n", cell_V_index, sh_pub_cells[cell_V_index]);

				// Increment cell index and manage overflow
				cell_V_index++;
				if(cell_V_index >= NUM_CELLS){
					cell_V_index = 0;
				}

				// Get refresh state to determine if last refresh was done. if not wait till it is. If so write new value
				sh_pub_command = PUB_RAM_ACCESS(uint8_t, PUB9_COMMAND);
				if((command == PUBLIC_COMMAND_SHUTDOWN) && (sh_pub_command != PUBLIC_COMMAND_DONE)){
					PUB_RAM_ACCESS(uint8_t, PUB9_COMMAND) = command;
				}
				while (Cy_IPC_Sema_Clear(SEMA_DISPLAY_VAR,  false) != CY_IPC_SEMA_SUCCESS){__WFE();}

				// Note that refresh was executed
				returnRefreshDone = 1;
			}
		}
	}

	// Return
	return returnRefreshDone;
}






/*******************************************************************************
* Function Name: SAR_HW_interrupt
********************************************************************************
* Summary:
* This function is the handler for SAR_HW interrupt
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
//void SAR_HW_interrupt(void)
//{
//    /* Check if End-Of-Scan trigger has occurred. If yes, set SAR_HW_isr_set flag to true  */
//    if (Cy_SAR_GetInterruptStatus(SAR_HW) & CY_SAR_INTR_EOS)
//    {
//        SAR_HW_isr_set = true;
//    }
//
//    /* Clear the interrupts */
//    Cy_SAR_ClearInterrupt(SAR_HW, CY_SAR_INTR);
//}




















void debugButtonCheck(){
	// Wait till semaphore is free and check button pressed
	static uint8_t btn_pressed = 0;

	// If button was detected as pressed send message and increment counter (Block until semaphore is free)
	if(cyhal_gpio_read(CYBSP_SWITCH) == 1 && (btn_pressed == 0)){
		// Reset switch on counter to make switch on possible again
		reset_safetySwitchTurnOn();

		//// Trigger safe state
		//saveStateEn_setLOW(); //cyhal_gpio_toggle(D_2ED4820_SAVE_STATE_EN);
		//PRINTF_MAIN_DEBUG("D_2ED4820_SAVE_STATE_EN  %d \r\n", cyhal_gpio_read(D_2ED4820_SAVE_STATE_EN));

		//// Trigger watchdog to test kill of system. Use first while to test software watchdog. Use second while to test hardware watchdog
		//while(1){
		//	1;
		//}
		//while(1){
		//	// Keep software watchdog alive - Increment main loop counter to keep watchdog handler inactive
		//	mainLoopCounter++;
		//}

		//// Simulate communication errors
		//PRINTF_MAIN_DEBUG("ComErr %d\r\n", numComErrors_TLE9012);
		//numComErrors_TLE9012 = 99;
		//PRINTF_MAIN_DEBUG("ComErr %d\r\n", numComErrors_TLE9012);

		// Test soft reset of controller
		//NVIC_SystemReset();

		// Print stored RT data memory as CSV
		//isWatchdogActive = 0;
		//memoryGetRtData(NULL, nextMemoryRtLineAddressOffset/MEM_SIZE_RT_DATA, 0, 1);
		//isWatchdogActive = 1;

		//// Send a UART message (Attempt to lock the semaphore)
		//while (Cy_IPC_Sema_Set(  SEMA_DEBUG_MSG, false) != CY_IPC_SEMA_SUCCESS){__WFE();}

		//// Read the ADC conversion result for corresponding ADC channel.
		//PRINTF_MAIN_DEBUG("Channel 0 CodeRes   input: %ldmV\r\n", adc_coding_res_mV);
		//PRINTF_MAIN_DEBUG("Channel 1 SWCurrent input: %ld, %ldmV\r\n", adc_safety_switch_current, adc_safety_switch_current_mV);

		//// Write RTC time
		//Cy_RTC_GetDateAndTime(&dateTime);
		//PRINTF_MAIN_DEBUG("Time: %02ld:%02ld:%02ld\r\n",dateTime.hour,dateTime.min,dateTime.sec);

		//// Block until semaphore is freed
		//while (Cy_IPC_Sema_Clear(SEMA_DEBUG_MSG, false) != CY_IPC_SEMA_SUCCESS){__WFE();}

		//// Send switch on veto message to potential other BMS
		//uint8_t targetData = 0;
		//if(statusBMS.slotState == SLOT_IN_SYSTEM_1){
		//	CAN_TX_Request(BMS_CLASS_MASK+1, BMS_SwitchOn_Veto, &targetData, 1);
		//}
		//else if(statusBMS.slotState == SLOT_IN_SYSTEM_2){
		//	CAN_TX_Request(BMS_CLASS_MASK, BMS_SwitchOn_Veto, &targetData, 1);
		//}

		// Mark button as pressed
		btn_pressed = 1;
	}
	else if(cyhal_gpio_read(CYBSP_SWITCH) == 0){
		// Reset button pressed
		btn_pressed = 0;
	}
}

#define SIZE_CYCLE_TIME_ARRAY 200
void debugRecordCycleTime(){
	static uint32_t lastCycleTimestamp = 0;
	static uint16_t cycleTimeArray[SIZE_CYCLE_TIME_ARRAY] = {0};
	static uint16_t  cycleTimeArrayIndex = 0;

	// Store SIZE_CYCLE_TIME_ARRAY times the cycle time
	cycleTimeArray[cycleTimeArrayIndex] = TIMER_COUNTER_1MS - lastCycleTimestamp;
	lastCycleTimestamp = TIMER_COUNTER_1MS;
	cycleTimeArrayIndex++;

	// If buffer runs over print all cycle times
	if(cycleTimeArrayIndex >= SIZE_CYCLE_TIME_ARRAY-1){
		PRINTF_MAIN_DEBUG("Cycle time records in ms: %d", cycleTimeArray[0]);
		for(uint8_t i = 1; i < SIZE_CYCLE_TIME_ARRAY; i++){
			PRINTF_MAIN_DEBUG(", %d", cycleTimeArray[i]);
		}
		PRINTF_MAIN_DEBUG("\r\n");
		cycleTimeArrayIndex = 0;
	}

}






/* [] END OF FILE */


